{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dhruv Doshi",
    "home_page_url": "https://dhruvdoshi.github.io/blog/",
    "feed_url": "https://dhruvdoshi.github.io/blog/feed.json",
    "description": "Blockchain Developer writing vlogs",
    "icon": "https://dhruvdoshi.github.io/blog/apple-touch-icon.png",
    "favicon": "https://dhruvdoshi.github.io/blog/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "Dhruv Doshi",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud",
            "title": "What if we combine Blockchain and Cloud Computing ?",
            "summary": "How the architecture of blockchain and cloud computing would be looking like.",
            "content_text": " Blockchain technology is distributed ledger with records of data containing all details of the transaction carried out and distributed among the nodes present in the network. All the transactions carried out previously are saved and then they are reflected in the next upcoming block hash. Hence it is an intangible and immutable data structure at the basic end.Cloud computing is well-defined technology that emerged from large-scale distributed computing technology. Cloud computing helps to reduce the burden on the resources and lets the user use the optimum resources for redundant work. Organizations like Google or Microsoft have large data servers and then the employees could get the required resources out of it. This helps the organization to have the flexibility of resources according to the projects. There are some evident issues in cloud computing which are Data Security, Data Management, Interoperability etc. By having the Blockchain concept with the cloud we could solve all of the issues or technical bottlenecks which we are facing at the moment with cloud computing. Blockchain technology is an emerging technology well known for its security and authenticity, which are the main characteristics that are making the world turn to its side. By integrating blockchain with cloud computing, there will be many advantages in usability, trust, security, scalability, data management, and many other advantages.There are several projects and Ideas which are working progressively in this direction, those are added in the references.REFERENCES C. V. N. U. B. Murthy, M. L. Shri, S. Kadry and S. Lim, \"Blockchain Based Cloud Computing: Architecture and Research Challenges,\" in IEEE Access, vol. 8, pp. 205190-205205, 2020, doi: 10.1109/ACCESS.2020.3036812.Nate Nead, “Blockchain’s Next Frontier: Cloud Computing?,” InvestmentBank.com, 09-Jun-2018. [Online]. Available: https://investmentbank.com/blockchain-cloud-computing/. [Accessed: 17-Oct-2021]‌Anna, “Blockchain vs Cloud Computing: Best Features for Corporate Space,” Gbksoft.com, 05-May-2021. [Online]. Available: https://gbksoft.com/blog/blockchain-vs-cloud-best-features-for-corporate-space/. [Accessed: 17-Oct-2021]‌",
            "content_html": "<p style=\"text-align: justify;\"> Blockchain technology is distributed ledger with records of data containing all details of the transaction carried out and distributed among the nodes present in the network. All the transactions carried out previously are saved and then they are reflected in the next upcoming block hash. Hence it is an intangible and immutable data structure at the basic end.<br /><br />Cloud computing is well-defined technology that emerged from large-scale distributed computing technology. Cloud computing helps to reduce the burden on the resources and lets the user use the optimum resources for redundant work. Organizations like Google or Microsoft have large data servers and then the employees could get the required resources out of it. This helps the organization to have the flexibility of resources according to the projects. <br /><br />There are some evident issues in cloud computing which are Data Security, Data Management, Interoperability etc. By having the Blockchain concept with the cloud we could solve all of the issues or technical bottlenecks which we are facing at the moment with cloud computing. Blockchain technology is an emerging technology well known for its security and authenticity, which are the main characteristics that are making the world turn to its side. By integrating blockchain with cloud computing, there will be many advantages in usability, trust, security, scalability, data management, and many other advantages.<br /><br />There are several projects and Ideas which are working progressively in this direction, those are added in the references.</p><hr /><h4 id=\"references\">REFERENCES</h4><p style=\"text-align: justify;\"> C. V. N. U. B. Murthy, M. L. Shri, S. Kadry and S. Lim, \"Blockchain Based Cloud Computing: Architecture and Research Challenges,\" in IEEE Access, vol. 8, pp. 205190-205205, 2020, doi: 10.1109/ACCESS.2020.3036812.<br /><br />Nate Nead, “Blockchain’s Next Frontier: Cloud Computing?,” InvestmentBank.com, 09-Jun-2018. [Online]. Available: https://investmentbank.com/blockchain-cloud-computing/. [Accessed: 17-Oct-2021]‌<br /><br />Anna, “Blockchain vs Cloud Computing: Best Features for Corporate Space,” Gbksoft.com, 05-May-2021. [Online]. Available: https://gbksoft.com/blog/blockchain-vs-cloud-best-features-for-corporate-space/. [Accessed: 17-Oct-2021]‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud",
            
            
            
            
            
            "date_published": "2019-10-31T00:00:00-03:00",
            "date_modified": "2019-10-31T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/10/01/where-could-be-blockchain-used",
            "title": "Where could be Blockchian be used ?",
            "summary": "where could be Blockchain be used?",
            "content_text": " Blockchain is freaking exciting and does have the potential to transform all of the business and how it operates, but that doesn’t mean it’s the right solution for every scenario. Here’s why you should choose blockchain  over, say, a standard outdated Centralized database:**When you want to manage and secure digital relationships or keep a decentralized, shared system of record.**  Anytime you want to keep a long-term, transparent record of assets (for example, to record property or land rights ), publically available data, blockchain could be the ideal solution. Smart contracts, in particular, are great for facilitating digital relationships and transactions. With a solidity smart contract, automated payments can be released when parties in a  transaction agree that their conditions have been met.**Anywhere a middleman or gatekeeper function is expensive or time-consuming.** For  example, major cloud services nowadays allows user to pile up the data on the servers which are organized by a single body or corporate like Google or Amazon, these services charges immensely instead of the single data serves system we could use decentralized systems like DCS-BBN or SIA data systems which are backed by the blockchain and have an ecosystem of the hosts and consumers which provides storage for the rent on lower tariffs**When you want to record secure transactions, especially between multiple partners.** A  traditional database may be good for recording simple transactions between two parties, but when things get more complicated, blockchain can reduce bottlenecks and simplify relationships. For example, shipping conglomerate Maersk is working with IBM to develop a private blockchain platform to connect its various partners and customers across the shipping industry. What’s more, the added security of a decentralized system makes blockchain ideal for transactions in general.**Where the data is in constant flux, but you want to keep a record of past actions.**  Blockchain is a better, safer way to record the activity and keep data fresh while maintaining a record of its history. The data can’t be  corrupted by anyone or accidentally deleted, and you benefit from both a  historical trail of data, plus an instantly up-to-date record REFERENCES Benjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.‌Benjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.",
            "content_html": "<p style=\"text-align: justify;\"> Blockchain is freaking exciting and does have the potential to transform all of the business and how it operates, but that doesn’t mean it’s the right solution for every scenario. Here’s why you should choose blockchain  over, say, a standard outdated Centralized database:<br /><br />**When you want to manage and secure digital relationships or keep a decentralized, shared system of record.**  Anytime you want to keep a long-term, transparent record of assets (for example, to record property or land rights ), publically available data, blockchain could be the ideal solution. Smart contracts, in particular, are great for facilitating digital relationships and transactions. With a solidity smart contract, automated payments can be released when parties in a  transaction agree that their conditions have been met.<br /><br />**Anywhere a middleman or gatekeeper function is expensive or time-consuming.** For  example, major cloud services nowadays allows user to pile up the data on the servers which are organized by a single body or corporate like Google or Amazon, these services charges immensely instead of the single data serves system we could use decentralized systems like DCS-BBN or SIA data systems which are backed by the blockchain and have an ecosystem of the hosts and consumers which provides storage for the rent on lower tariffs<br /><br />**When you want to record secure transactions, especially between multiple partners.** A  traditional database may be good for recording simple transactions between two parties, but when things get more complicated, blockchain can reduce bottlenecks and simplify relationships. For example, shipping conglomerate Maersk is working with IBM to develop a private blockchain platform to connect its various partners and customers across the shipping industry. What’s more, the added security of a decentralized system makes blockchain ideal for transactions in general.<br /><br />**Where the data is in constant flux, but you want to keep a record of past actions.**  Blockchain is a better, safer way to record the activity and keep data fresh while maintaining a record of its history. The data can’t be  corrupted by anyone or accidentally deleted, and you benefit from both a  historical trail of data, plus an instantly up-to-date record </p><hr /><h4 id=\"references\">REFERENCES</h4><p style=\"text-align: justify;\"> Benjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.<br /><br />‌Benjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/10/01/where-could-be-blockchain-used",
            
            
            
            
            
            "date_published": "2019-10-01T00:00:00-03:00",
            "date_modified": "2019-10-01T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain",
            "title": "What is Blockchain ?",
            "summary": "What is the blockchain?",
            "content_text": " Blockchain is the technology that allows the user to create a decentralized system of transaction and data transfers. Saying more on, for the naïve person it is a method to create a people’s bank without central banks! Blockchain technology is used in the backend for each cryptocurrency. Talking about that, Blockchain is creating the blocks of every significant data and then chaining the blocks. So if the last block or any previous block is changed or updated, then every information in the chain needs to be updated. This makes blockchain technology secure and more robust compared to other technologies.Blockchain is a shared, immutable ledger that felicitates the process of recording transactions and tracking assets in a business network. An asset can be tangible (a house or a car) or intangible (Intellectual property, patents or copyrights). Virtually anything of value can be tracked and traded on a blockchain network, reducing risk and cutting costs for all involved.Finally, Blockchain is a growing list of records, called blocks that are linked together with cryptography which is also described as “trustless and fully decentralized peer to peer immutable data storage which is spread over the network of participants often referred to as the nodes. Every block contains a cryptographic hash of the previous block and the timestamp and the transaction data in it. But first, let's get back to basics. What is blockchain, and how does it work?A blockchain is a file for storing data. Or, to put it in more technical terms, it’s an open, distributed database system. The data is distributed (i.e. duplicated) across many computers, and the whole blockchain is completely decentralized. This means no one person or entity  (say, a government or corporation like Google or Microsoft) has control over the blockchain;  this is a radical departure from the centralized (Government databases) databases that are controlled and administered by businesses and other entities.So how does it work? In very simple terms, the file consists of blocks of data, with each block being connected to the previous block with the hashing code,  forming a chain. Hence, the name ‘blockchain’. As well as the data itself, each block also contains a record of when that block was created or edited it contains the hash code of the previous block, which makes it very useful for maintaining a detailed system of record that cannot be corrupted or lost and this is the major use case to maintain the integrity of the data. Because the whole blockchain is duplicated across many computers,  any user can view the entire blockchain in the case of public blockchains. Transactions or records are processed not by one central administrator, but by a network of users who work to verify the data and achieve a consensus, these verifiers are known as miners, each miner is paid some sort of cryptocurrency for successful mining. If this sounds familiar, it’s because Bitcoin operates in the same way. Bitcoin is the first example of blockchain in action.REFERENCES: “What Is Blockchain Technology? - IBM Blockchain | IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.",
            "content_html": "<p style=\"text-align: justify;\"> Blockchain is the technology that allows the user to create a decentralized system of transaction and data transfers. Saying more on, for the naïve person it is a method to create a people’s bank without central banks! Blockchain technology is used in the backend for each cryptocurrency. Talking about that, Blockchain is creating the blocks of every significant data and then chaining the blocks. So if the last block or any previous block is changed or updated, then every information in the chain needs to be updated. This makes blockchain technology secure and more robust compared to other technologies.<br /><br />Blockchain is a shared, immutable ledger that felicitates the process of recording transactions and tracking assets in a business network. An asset can be tangible (a house or a car) or intangible (Intellectual property, patents or copyrights). Virtually anything of value can be tracked and traded on a blockchain network, reducing risk and cutting costs for all involved.<br /><br />Finally, Blockchain is a growing list of records, called blocks that are linked together with cryptography which is also described as “trustless and fully decentralized peer to peer immutable data storage which is spread over the network of participants often referred to as the nodes. Every block contains a cryptographic hash of the previous block and the timestamp and the transaction data in it. <br /><br />But first, let's get back to basics. What is blockchain, and how does it work?A blockchain is a file for storing data. Or, to put it in more technical terms, it’s an open, distributed database system. The data is distributed (i.e. duplicated) across many computers, and the whole blockchain is completely decentralized. This means no one person or entity  (say, a government or corporation like Google or Microsoft) has control over the blockchain;  this is a radical departure from the centralized (Government databases) databases that are controlled and administered by businesses and other entities.<br /><br />So how does it work? In very simple terms, the file consists of blocks of data, with each block being connected to the previous block with the hashing code,  forming a chain. Hence, the name ‘blockchain’. As well as the data itself, each block also contains a record of when that block was created or edited it contains the hash code of the previous block, which makes it very useful for maintaining a detailed system of record that cannot be corrupted or lost and this is the major use case to maintain the integrity of the data.<br /><br /> Because the whole blockchain is duplicated across many computers,  any user can view the entire blockchain in the case of public blockchains. Transactions or records are processed not by one central administrator, but by a network of users who work to verify the data and achieve a consensus, these verifiers are known as miners, each miner is paid some sort of cryptocurrency for successful mining. If this sounds familiar, it’s because Bitcoin operates in the same way. Bitcoin is the first example of blockchain in action.</p><hr /><p><br /></p><h4 id=\"references\">REFERENCES:</h4><p style=\"text-align: justify;\"> “What Is Blockchain Technology? - IBM Blockchain | IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.<br /><br />‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain",
            
            
            
            
            
            "date_published": "2019-08-31T00:00:00-03:00",
            "date_modified": "2019-08-31T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}