{
    "version": "https://jsonfeed.org/version/1",
    "title": "Dhruv Doshi",
    "home_page_url": "https://dhruvdoshi.github.io/blog/",
    "feed_url": "https://dhruvdoshi.github.io/blog/feed.json",
    "description": "Here are some blogs majorly on Blockchian and Cryptocurrencies. This website comes up with the search feature and all the blogs are completely written in Markdown.",
    "icon": "https://dhruvdoshi.github.io/blog/apple-touch-icon.png",
    "favicon": "https://dhruvdoshi.github.io/blog/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "Dhruv Doshi",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2021/02/15/what-is-cloud-computing",
            "title": "What is Cloud Computing?",
            "summary": "This blog emphasizes what is the meaning of cloud computing is!",
            "content_text": "CLOUD COMPUTINGCloud computing is the on-demand availability of computer system resources, especially data storage (cloud storage) and computing power, without direct active management by the user. Large clouds often have functions distributed over multiple locations, each location being a data center. Cloud computing relies on sharing of resources to achieve coherence[clarification needed] and economies of scale, typically using a “pay-as-you-go” model which can help in reducing capital expenses but may also lead to unexpected operating expenses for unaware users.Service ModelsThere are five service models out of them top 3 are widely used and most of the content ofinternet uses these kind of service models.  Infrastructure as a Service (Iaas)  Platform as a Service (PaaS)  Software as a Service (SaaS)  Mobile backend as a Service (MBaaS)  Serverless computing or Function as a Service (FaaS)Control comparison between all major modelsMajor Deployment ModelsTo deply the cloud architecture there are three ways we could do. With private being the most used till today organizations are moving to use Hybrid cloud more nowadyas and also migrating towards also.  Private Cloud  Public Cloud  Hybrid Cloud Other Deployment Models  Community Cloud  Distributed Cloud  Multi Cloud   Poly Cloud  Big Data Cloud  HPC CloudSecurity and PrivacyCloud computing poses privacy concerns because the service provider can access the data that is in the cloud at any time. It could accidentally or deliberately alter or delete information. Many cloud providers can share information with third parties if necessary for purposes of law and order without a warrant. That is permitted in their privacy policies, which users must agree to before they start using cloud services. Solutions to privacy include policy and legislation as well as end-users’ choices for how data is stored. Users can encrypt data that is processed or stored within the cloud to prevent unauthorized access. Identity management systems can also provide practical solutions to privacy concerns in cloud computing. These systems distinguish between authorized and unauthorized users and determine the amount of data that is accessible to each entity. The systems work by creating and describing identities, recording activities, and getting rid of unused identities.According to the Cloud Security Alliance, the top three threats in the cloud are Insecure Interfaces and APIs, Data Loss &amp; Leakage, and Hardware Failure—which accounted for 29%, 25% and 10% of all cloud security outages respectively. Together, these form shared technology vulnerabilities. In a cloud provider platform being shared by different users, there may be a possibility that information belonging to different customers resides on the same data server. Additionally, Eugene Schultz, chief technology officer at Emagined Security, said that hackers are spending substantial time and effort looking for ways to penetrate the cloud. “There are some real Achilles’ heels in the cloud infrastructure that are making big holes for the bad guys to get into”. Because data from hundreds or thousands of companies can be stored on large cloud servers, hackers can theoretically gain control of huge stores of information through a single attack—a process he called “hyperjacking”. Some examples of this include the Dropbox security breach, and iCloud 2014 leak. Dropbox had been breached in October 2014, having over 7 million of its users passwords stolen by hackers in an effort to get monetary value from it by Bitcoins (BTC). By having these passwords, they are able to read private data as well as have this data be indexed by search engines (making the information public).There is the problem of legal ownership of the data (If a user stores some data in the cloud, can the cloud provider profit from it?). Many Terms of Service agreements are silent on the question of ownership. Physical control of the computer equipment (private cloud) is more secure than having the equipment off-site and under someone else’s control (public cloud). This delivers great incentive to public cloud computing service providers to prioritize building and maintaining strong management of secure services. Some small businesses that don’t have expertise in IT security could find that it’s more secure for them to use a public cloud. There is the risk that end users do not understand the issues involved when signing on to a cloud service (persons sometimes don’t read the many pages of the terms of service agreement, and just click “Accept” without reading). This is important now that cloud computing is becoming popular and required for some services to work, for example for an intelligent personal assistant (Apple’s Siri or Google Now). Fundamentally, private cloud is seen as more secure with higher levels of control for the owner, however public cloud is seen to be more flexible and requires less time and money investment from the user.To resolve these king of security and privacy concerns we could come up with the cloud service which could be clubbed up with Blockchain Technology.Limitations and DisadvanatagesThere are immense potential in cloud computing and features which could be extracted and which makes the developer life easy and easy to extend the resources power with minimal investment.  Downtime   Security and Privacy   Vulnerablity to attack   Limited control and flexiblity   Vender Locking   Cost Concerns You could find more information on all of these topics from the home page.REFERENCESWikipedia Contributors. (2021, December 15). Cloud computing. Retrieved December 21, 2021, from Wikipedia website: https://en.wikipedia.org/wiki/Cloud_computingLarkin, A. (2019, August 7). Disadvantages of Cloud Computing. Retrieved December 21, 2021, from Cloud Academy website: https://cloudacademy.com/blog/disadvantages-of-cloud-computing/",
            "content_html": "<p><b><span style=\"color:green\">CLOUD COMPUTING</span></b><br /></p><p>Cloud computing is the on-demand availability of computer system resources, especially data storage (cloud storage) and computing power, without direct active management by the user. Large clouds often have functions distributed over multiple locations, each location being a data center. Cloud computing relies on sharing of resources to achieve coherence[clarification needed] and economies of scale, typically using a “pay-as-you-go” model which can help in reducing capital expenses but may also lead to unexpected operating expenses for unaware users.</p><p><b><span style=\"color:green\">Service Models</span></b><br />There are five service models out of them top 3 are widely used and most of the content ofinternet uses these kind of service models.</p><ol>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain\">Infrastructure as a Service (Iaas)</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/01/what-is-nodes-in-blockchain\">Platform as a Service (PaaS)</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/02/what-is-timestamping-in-blockchain\">Software as a Service (SaaS)</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/03/what-is-mining-in-blockchain\">Mobile backend as a Service (MBaaS)</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/04/what-is-wallet-in-blockchain\">Serverless computing or Function as a Service (FaaS)</a></li></ol><!-- <center><img src=\"https://1.cms.s81c.com/sites/default/files/2021-05-04/ICLH_Diagram_Batch_02_11-PaaS-IaaS-SaaS-Serverless-WHITEBG.png\"></center> --><p><br /><b><span style=\"color:green\">Control comparison between all major models</span></b><br /></p><center><img src=\"https://github.com/DhruvDoshi/blog/blob/master/_posts/img/Iaas-Saas-Paas-comparison.png\" style=\"height:40%; width:80%;\" /></center><p><b><span style=\"color:green\">Major Deployment Models</span></b><br />To deply the cloud architecture there are three ways we could do. With private being the most used till today organizations are moving to use Hybrid cloud more nowadyas and also migrating towards also.</p><ol>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain\">Private Cloud</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/01/what-is-nodes-in-blockchain\">Public Cloud</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/02/what-is-timestamping-in-blockchain\">Hybrid Cloud </a></li></ol><p><b><span style=\"color:green\">Other Deployment Models</span></b><br /></p><ol>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain\">Community Cloud</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/01/what-is-nodes-in-blockchain\">Distributed Cloud</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/02/what-is-timestamping-in-blockchain\">Multi Cloud </a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/03/what-is-mining-in-blockchain\">Poly Cloud</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/04/what-is-wallet-in-blockchain\">Big Data Cloud</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/05/what-is-anonimity-in-blockchain\">HPC Cloud</a></li></ol><p><b><span style=\"color:green\">Security and Privacy</span></b><br /></p><p>Cloud computing poses privacy concerns because the service provider can access the data that is in the cloud at any time. It could accidentally or deliberately alter or delete information. Many cloud providers can share information with third parties if necessary for purposes of law and order without a warrant. That is permitted in their privacy policies, which users must agree to before they start using cloud services. Solutions to privacy include policy and legislation as well as end-users’ choices for how data is stored. Users can encrypt data that is processed or stored within the cloud to prevent unauthorized access. Identity management systems can also provide practical solutions to privacy concerns in cloud computing. These systems distinguish between authorized and unauthorized users and determine the amount of data that is accessible to each entity. The systems work by creating and describing identities, recording activities, and getting rid of unused identities.</p><p>According to the Cloud Security Alliance, the top three threats in the cloud are Insecure Interfaces and APIs, Data Loss &amp; Leakage, and Hardware Failure—which accounted for 29%, 25% and 10% of all cloud security outages respectively. Together, these form shared technology vulnerabilities. In a cloud provider platform being shared by different users, there may be a possibility that information belonging to different customers resides on the same data server. Additionally, Eugene Schultz, chief technology officer at Emagined Security, said that hackers are spending substantial time and effort looking for ways to penetrate the cloud. “There are some real Achilles’ heels in the cloud infrastructure that are making big holes for the bad guys to get into”. Because data from hundreds or thousands of companies can be stored on large cloud servers, hackers can theoretically gain control of huge stores of information through a single attack—a process he called “hyperjacking”. Some examples of this include the Dropbox security breach, and iCloud 2014 leak. Dropbox had been breached in October 2014, having over 7 million of its users passwords stolen by hackers in an effort to get monetary value from it by Bitcoins (BTC). By having these passwords, they are able to read private data as well as have this data be indexed by search engines (making the information public).</p><p>There is the problem of legal ownership of the data (If a user stores some data in the cloud, can the cloud provider profit from it?). Many Terms of Service agreements are silent on the question of ownership. Physical control of the computer equipment (private cloud) is more secure than having the equipment off-site and under someone else’s control (public cloud). This delivers great incentive to public cloud computing service providers to prioritize building and maintaining strong management of secure services. Some small businesses that don’t have expertise in IT security could find that it’s more secure for them to use a public cloud. There is the risk that end users do not understand the issues involved when signing on to a cloud service (persons sometimes don’t read the many pages of the terms of service agreement, and just click “Accept” without reading). This is important now that cloud computing is becoming popular and required for some services to work, for example for an intelligent personal assistant (Apple’s Siri or Google Now). Fundamentally, private cloud is seen as more secure with higher levels of control for the owner, however public cloud is seen to be more flexible and requires less time and money investment from the user.</p><p>To resolve these king of security and privacy concerns we could come up with the cloud service which could be clubbed up with <b><a href=\"https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud\">Blockchain Technology</a></b>.</p><p><b><span style=\"color:green\">Limitations and Disadvanatages</span></b><br />There are immense potential in cloud computing and features which could be extracted and which makes the developer life easy and easy to extend the resources power with minimal investment.</p><ol>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud\">Downtime </a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud\">Security and Privacy </a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud\">Vulnerablity to attack </a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud\">Limited control and flexiblity </a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud\">Vender Locking </a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud\">Cost Concerns </a></li></ol><p>You could find more information on all of these topics from the <a href=\"https://dhruvdoshi.github.io/blog\">home</a> page.</p><hr /><h4 id=\"references\">REFERENCES</h4><p>Wikipedia Contributors. (2021, December 15). Cloud computing. Retrieved December 21, 2021, from Wikipedia website: https://en.wikipedia.org/wiki/Cloud_computing</p><p>Larkin, A. (2019, August 7). Disadvantages of Cloud Computing. Retrieved December 21, 2021, from Cloud Academy website: https://cloudacademy.com/blog/disadvantages-of-cloud-computing/</p>",
            "url": "https://dhruvdoshi.github.io/blog/2021/02/15/what-is-cloud-computing",
            
            
            
            "tags": ["blockchain","cloud-computing"],
            
            "date_published": "2021-02-15T00:00:00-04:00",
            "date_modified": "2021-02-15T00:00:00-04:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2021/01/31/what-is-cryptocurrency",
            "title": "What is cryptocurrency?",
            "summary": "This blog emphasizes what cryptocurrency means and how cryptocurrency is relevant in today's day and age.",
            "content_text": "CRYPTOCURRENCYA cryptocurrency, crypto-currency, or crypto is a collection of binary data which is designed to work as a medium of exchange wherein individual coin ownership records are stored in a ledger which is a computerized database using strong cryptography to secure transaction records, to control the creation of additional coins, and to verify the transfer of coin ownership.Crypto algorithms are around in the computer domain since 1983 but the induction of hashing and development of blockchain came to the public around 2008 by Satoshi Nakamoto and after the publication of a research paper which was empathizing on proof of work algorithm, a new cryptocurrency came up named Bitcoin.There are more than 6000 cryptocurrencies in existence today in 2021. The major chunk of them was developed in the last decade. Those are all working in different algorithms like proof of stake or proof of work, there are dozen more algorithms available over the internet!What is CryptocurrenciesAccording to Jan Lansky, a cryptocurrency is a system that meets six conditions  The system does not require a Central Authority; its state is maintained through distributed consensus.  The system keeps an overview of cryptocurrency units and their ownership.  The system defines whether new cryptocurrency units can be created. If new cryptocurrency units can be created, the system defines the circumstances of their origin and how to determine the ownership of these new units.  Ownership of cryptocurrency units can be proved exclusively cryptographically.  The system allows transactions to be performed in which ownership of the cryptographic units is changed. A transaction statement can only be issued by an entity proving the current ownership of these units.  If two different instructions for changing the ownership of the same cryptographic units are simultaneously entered, the system performs at most one of them.In March 2018, the word cryptocurrency was added to the Merriam-Webster Dictionary.There are numerous things more which we need to understand to know more about the working of cryptocurrencies.  Blockchain  Nodes  Time Stamping  Mining  Wallet  Anonymity  Transaction Fees  Exchanges  Automatic Swaps  ATM’s  Initial Coin Offering You could find more information on all of these topics from the home page.REFERENCESWikipedia Contributors. “Cryptocurrency.” Wikipedia, Wikimedia Foundation, 15 Feb. 2019, en.wikipedia.org/wiki/Cryptocurrency.",
            "content_html": "<p><b><span style=\"color:green\">CRYPTOCURRENCY</span></b><br /></p><p>A cryptocurrency, crypto-currency, or crypto is a collection of binary data which is designed to work as a medium of exchange wherein individual coin ownership records are stored in a ledger which is a computerized database using strong cryptography to secure transaction records, to control the creation of additional coins, and to verify the transfer of coin ownership.</p><p>Crypto algorithms are around in the computer domain since 1983 but the induction of hashing and development of blockchain came to the public around 2008 by Satoshi Nakamoto and after the publication of a research paper which was empathizing on proof of work algorithm, a new cryptocurrency came up named Bitcoin.</p><p>There are more than <b><span style=\"color:green\">6000 cryptocurrencies</span></b> in existence today in 2021. The major chunk of them was developed in the last decade. Those are all working in different algorithms like proof of stake or proof of work, there are dozen more algorithms available over the internet!</p><p><b><span style=\"color:green\">What is Cryptocurrencies</span></b><br />According to <em>Jan Lansky</em>, a cryptocurrency is a system that meets six conditions</p><ol>  <li>The system does not require a <b><span style=\"color:green\">Central Authority</span></b>; its state is maintained through distributed consensus.</li>  <li>The system keeps an overview of cryptocurrency units and their ownership.</li>  <li>The system defines whether new cryptocurrency units can be created. If new cryptocurrency units can be created, the system defines the circumstances of their origin and how to determine the ownership of these new units.</li>  <li>Ownership of cryptocurrency units can be <b><span style=\"color:green\">proved exclusively cryptographically.</span></b></li>  <li>The system allows transactions to be performed in which ownership of the cryptographic units is changed. A transaction statement can only be issued by an entity proving the current ownership of these units.</li>  <li>If two different instructions for changing the ownership of the same cryptographic units are simultaneously entered, the system <b><span style=\"color:green\">performs at most one of them.</span></b></li></ol><p>In March 2018, the word cryptocurrency was added to the <b><span style=\"color:green\">Merriam-Webster Dictionary.</span></b></p><p>There are numerous things more which we need to understand to know more about the working of cryptocurrencies.</p><ol>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain\">Blockchain</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/01/what-is-nodes-in-blockchain\">Nodes</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/02/what-is-timestamping-in-blockchain\">Time Stamping</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/03/what-is-mining-in-blockchain\">Mining</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/04/what-is-wallet-in-blockchain\">Wallet</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/05/what-is-anonimity-in-blockchain\">Anonymity</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/06/what-is-transaction-fees-in-blockchain\">Transaction Fees</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/07/what-is-exchanges-in-blockchain\">Exchanges</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/08/what-is-automativ-swaps-in-blockchain\">Automatic Swaps</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/09/what-is-cryptocurrency-atm\">ATM’s</a></li>  <li><a href=\"https://dhruvdoshi.github.io/blog/2019/09/10/what-is-cryptocurrency-ico\">Initial Coin Offering </a></li></ol><p>You could find more information on all of these topics from the <a href=\"https://dhruvdoshi.github.io/blog\">home</a> page.</p><hr /><h4 id=\"references\">REFERENCES</h4><p>Wikipedia Contributors. “Cryptocurrency.” Wikipedia, Wikimedia Foundation, 15 Feb. 2019, en.wikipedia.org/wiki/Cryptocurrency.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2021/01/31/what-is-cryptocurrency",
            
            
            
            
            
            "date_published": "2021-01-31T00:00:00-04:00",
            "date_modified": "2021-01-31T00:00:00-04:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2020/12/31/how-banks-could-retaliate",
            "title": "How Banks could retaliate to the blockchain industry",
            "summary": "As per the previous blog it is evident that blockchain tech is coming for the banking and the finance industry, now in this section we would be listing that how banks could retaliate.",
            "content_text": "How should banks react?As the financial service industry is moving from the exploration phase to the application phase for blockchain, banks need to understand the future role of blockchain and its impact on banking services if they want to take advantage of this financial revolution.Success will depend on how banks quickly respond to opportunities for innovation. Used effectively, disruption is key to driving organizational change and taking the business to the next level.Disruption can be a valuable way for banks to reinvent their organization by challenging competitors and identifying growth opportunities. To be able to work effectively in the new eco-system, banks should identify radically new ways to conduct business. They, therefore, have to change their old business models and personal skills and create new, viable models for the blockchain age to be able to combat new competitors.“It’s a very interesting space to watch. It’s clear that blockchain has the potential to make finance more efficient, but the big players are well-established. And establishments don’t tend to favour innovation. I’d keep an eye on the start-ups who want to disrupt, but also know how to play nice with the institutions.” Jeff KoyenForward thinkingWhile the process of disruption triggered by blockchain technology has only just begun, many expect it to speed up soon. This and the coming years we will – as a result - see a lot of changes in the banking industry, while new players will enter the market. Blockchain may eliminate some roles in financial services in the short term.Although the financial industry is thrilled about blockchain, the technology will take a few years to become a mainstream financial model. That means that disruption will happen gradually – but surely. In the meantime, banks have the time to prepare and adjust so that they can have a “second life” in a blockchain world.The way blockchain is driving disruption in the traditional financial services industry is however not straightforward but may occur in both obvious and not so obvious ways. The future of the financial services industry will thereby depend on how the various stakeholders including banks capitalize on this technology and how they interact with each other.But when financial institutions fully adopt this technology, we should see these gained efficiencies in the form of lower fees for consumers, creating a renewed promising customer experience by banks.In that case, these banks may survive ….REFERENCESCarlo R.W. De Meijer. “Blockchain and Disruption in the Financial World: Will Banks Survive?” Blockchain and Disruption in the Financial World: Will Banks Survive?, Finextra, 12 Feb. 2019, https://www.finextra.com/blogposting/16658/blockchain-and-disruption-in-the-financial-world-will-banks-survive.",
            "content_html": "<p><b><span style=\"color:green\">How should banks react?</span></b><br /></p><p>As the financial service industry is moving from the exploration phase to the application phase for blockchain, banks need to understand the future role of blockchain and its impact on banking services if they want to take advantage of this financial revolution.</p><p>Success will depend on how banks quickly respond to opportunities for innovation. Used effectively, disruption is key to driving organizational change and taking the business to the next level.</p><p>Disruption can be a valuable way for banks to reinvent their organization by challenging competitors and identifying growth opportunities. To be able to work effectively in the new eco-system, banks should identify radically new ways to conduct business. They, therefore, have to change their old business models and personal skills and create new, viable models for the blockchain age to be able to combat new competitors.</p><p><em>“It’s a very interesting space to watch. It’s clear that blockchain has the potential to make finance more efficient, but the big players are well-established. And establishments don’t tend to favour innovation. I’d keep an eye on the start-ups who want to disrupt, but also know how to play nice with the institutions.”</em> Jeff Koyen</p><p><br /><b><span style=\"color:green\">Forward thinking</span></b><br /></p><p>While the process of disruption triggered by blockchain technology has only just begun, many expect it to speed up soon. This and the coming years we will – as a result - see a lot of changes in the banking industry, while new players will enter the market. Blockchain may eliminate some roles in financial services in the short term.</p><p>Although the financial industry is thrilled about blockchain, the technology will take a few years to become a mainstream financial model. That means that disruption will happen gradually – but surely. In the meantime, banks have the time to prepare and adjust so that they can have a “second life” in a blockchain world.</p><p>The way blockchain is driving disruption in the traditional financial services industry is however not straightforward but may occur in both obvious and not so obvious ways. The future of the financial services industry will thereby depend on how the various stakeholders including banks capitalize on this technology and how they interact with each other.</p><p>But when financial institutions fully adopt this technology, we should see these gained efficiencies in the form of lower fees for consumers, creating a renewed promising customer experience by banks.</p><p>In that case, these banks may survive ….</p><hr /><h4 id=\"references\">REFERENCES</h4><p>Carlo R.W. De Meijer. “Blockchain and Disruption in the Financial World: Will Banks Survive?” Blockchain and Disruption in the Financial World: Will Banks Survive?, Finextra, 12 Feb. 2019, https://www.finextra.com/blogposting/16658/blockchain-and-disruption-in-the-financial-world-will-banks-survive.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2020/12/31/how-banks-could-retaliate",
            
            
            
            
            
            "date_published": "2020-12-31T00:00:00-04:00",
            "date_modified": "2020-12-31T00:00:00-04:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2020/12/01/how-blockchain-could-distupt-banking",
            "title": "How Blockchain Could Disrupt Banking Industry?",
            "summary": "This blog contains details that deal with the results of using blockchain technology in the banking industry. There are many references included in the blog which are from one of the topmost financial institutions like JP Morgan and Chase.",
            "content_text": "In today’s day and age, banks are the most important key point in the whole finance ecosystem where they serve as the critical storehouses and transfer hubs of value. Now with the induction of Blockchain in this domain, the role of banks in the transaction and the value of fiat currency is going down day by day hence there could be a scenario where blockchain could propose a big threat to large institutions like JP Morgan and Credit Suisse.What makes blockchain (so) disruptive for banks?The answer to this question lies in the three specific in-build properties of a blockchain: Decentralized, distributed and Immutability. These differ completely from those of banks that are centralized organizations.      Decentalized Network Blockchain operates on a decentralized network, that is acting on a peer-to-peer basis. It handles all operations similar to a bank, but without any central authority that monitors all data. So it potentially cuts out the middleman, giving back the power to the owner of the assets (i.e. data or tokens carrying some financial value). All information is stored across its network via blocks. These blocks, which are time-stamped and linked together with all past and current transactions, are permanently recorded and consistently reconciled and updated in a cryptographically secure way. By storing data across its network, blockchain eliminates the risks that come with data being held centrally.        Distributed LedgerA second property of blockchain is the distributed ledger, that allows sharing of a ledger of activity - such as arbitrary data or virtually anything of value between multiple parties. What makes blockchain so important is its ability to automate trust and transparency among all parties using it. Because the ledger is distributed among all transaction participants, it exists simultaneously in multiple places. Each of the computers in the distributed network maintains a copy of the ledger to ensure transparency and also prevent a single point of failure and all copies are updated and validated simultaneously. This makes it extremely difficult to manipulate entries or tamper with the data without the other parties noticing.        Immutable Records A third unique property is its immutability. By design, blockchains are inherently resistant to modification of data. All blockchain networks adhere to a certain protocol for validating new blocks. No changes can be made once the system is set with the initial standards. Once recorded, the data in any given block cannot be altered without the alteration of all the subsequent blocks, which requires the consensus of the network majority.  Where will be blockchain hit on the Banks ??Though blockchain is said to have an impact on virtually every aspect of the financial system, most disruptive use cases can be found in activities such as cross border payments and remittances, share trading, clearing and settlement, trade finance and supply chain finance, regulatory reporting and compliance, as well as smart contracts. It is however clear that when the technology further evolves there will be many more areas for applying the blockchain technologies emerging.      Cross border payments  It is not surprising that payments are emerging as the first and foremost blockchain use case of any banking and/or financial system. Nowadays payments across borders are a time-consuming and expensive process, given the need for correspondent banks or other intermediaries.    Blockchain offers an easy and secure solution, as it will not require third party authorization. . By cutting out many of the traditional middlemen, the laborious and costly process of cross border payments is simplified, thus significantly speeding up the cross-border payment process and that at a cost much less than with the traditional banking systems.        Share Trading  Using blockchain for buying and selling stocks and shares could also bring several significant benefits. Share trading involves many third parties, such as brokers, CCPs, CSDs and exchanges, making this process time-consuming.    The decentralized nature of blockchain technology can remove all those intermediaries and enable trading to be run on computers all over the world. Eliminating some of the middlemen from the share trading process speeds up the settlement process and allows for greater trade accuracy. Trading transactions in blockchain thereby reduces the redundancy of information and thus improves performance.        Clearing and settlement  The global cash settlement for fixed income, equity, and derivative products in various currencies is slow, costly, and complicated. Because of the large number of parties involved, It takes several days to settle.    By eliminating a large number of intermediaries, blockchain enables instantaneous settlement leading to substantially lower costs        Trade Finance  Many trade finance activities still involve lots of paperwork, such as bills of lading, invoices, letters of credit etc. All participants in the trade chain must maintain their database for all transaction-related documents, that must be constantly reconciled against each other. It is as a result a time-consuming activity.    Blockchain-based trade finance can streamline the entire trading process by getting rid of this time-consuming paperwork and bureaucracy. It eliminates the need for several copies of the same document and can integrate all necessary information in one digital document, which is updated in real-time and can be accessed by all network members.        Digital Identity Verification  Another area where customer experience could be significantly improved when using blockchain is in the digital identity verification process. Online financial transactions require a lot of steps to be taken, including face-to-face checking, authentication, authorization etc. All of these steps need to be taken for each new service provider.    Blockchain makes it possible to securely re-use identity verification for other services. With blockchain, users can choose how they identify themselves and with whom they agree to share their identity. They still need to register their identity on the blockchain, but they do not need to repeat the registration for each service provider if those providers are also powered by blockchain.        Smart Contracts  Smart contracts are another way to fundamentally change the way business is done nowadays. The functions of a bank such as lending, deposits, treasury, investment advice, business intelligence, regulatory compliance, payments, and remittances will be disrupted by using these contracts.    Through the use of smart contracts, blockchain technology will change the way information and money are exchanged in finance (and in many other industries). Smart contracts enable operating and automating business processes in a fully decentralized fashion, enabling shared rules of engagement, conduct, and business processes to be automated and enforced ecosystem-wide.        Intensive collaboration  The blockchain-based bank ecosystem will be one of intensive collaboration, within an increasingly open banking environment, not only with other banks but also with various third parties in the financial chain. Whether the third party is a payment processor, a fintech startup or a creative app developer.    Future success will depend on their willingness to co-operate – even with the apparent challengers to their core activities. Banks don’t have a choice in this – not if they want to survive and prosper. Although it might seem counterintuitive to banks to facilitate new services beyond their immediate control and balance sheets, standing in the way of external creativity and innovation carries the greater risk.        Bank-fintech partnerships  Even as the disruptions continue, the ecosystem will see deeper collaboration between financial institutions and fintech firms and the creation of platform companies to meet the changing needs of their customers. While fintech companies have the advantage of innovation, financial institutions provide a sandbox for proof of concept and scale.    Most fintech start-ups lack several features for a stand-alone existence, that are well known for traditional banks. Fintech firms need to be wary of product functionality, flexibility, scalability and compliance. Banks have the advantages of greater resources and a larger scale. Good partnerships between banks and fintech could bring the best for both worlds.  These are the domains in which banks could face the competition and could potentially lose ground against Blockchain technology and cryptocurrencies.REFERENCESCarlo R.W. De Meijer. “Blockchain and Disruption in the Financial World: Will Banks Survive?” Blockchain and Disruption in the Financial World: Will Banks Survive?, Finextra, 12 Feb. 2019, https://www.finextra.com/blogposting/16658/blockchain-and-disruption-in-the-financial-world-will-banks-survive.",
            "content_html": "<p>In today’s day and age, banks are the most important key point in the whole finance ecosystem where they serve as the critical storehouses and transfer hubs of value. Now with the induction of Blockchain in this domain, the role of banks in the transaction and the value of fiat currency is going down day by day hence there could be a scenario where blockchain could propose a big threat to large institutions like JP Morgan and Credit Suisse.</p><p><b><span style=\"color:green\">What makes blockchain (so) disruptive for banks?</span></b><br />The answer to this question lies in the three specific in-build properties of a blockchain: Decentralized, distributed and Immutability. These differ completely from those of banks that are centralized organizations.</p><ul>  <li>    <p><b><span style=\"color:green\">Decentalized Network</span></b><br /> Blockchain operates on a decentralized network, that is acting on a peer-to-peer basis. It handles all operations similar to a bank, but without any central authority that monitors all data. So it potentially cuts out the middleman, giving back the power to the owner of the assets (i.e. data or tokens carrying some financial value). All information is stored across its network via blocks. These blocks, which are time-stamped and linked together with all past and current transactions, are permanently recorded and consistently reconciled and updated in a cryptographically secure way. By storing data across its network, blockchain eliminates the risks that come with data being held centrally.</p>  </li>  <li>    <p><b><span style=\"color:green\">Distributed Ledger</span></b><br />A second property of blockchain is the distributed ledger, that allows sharing of a ledger of activity - such as arbitrary data or virtually anything of value between multiple parties. What makes blockchain so important is its ability to automate trust and transparency among all parties using it. Because the ledger is distributed among all transaction participants, it exists simultaneously in multiple places. Each of the computers in the distributed network maintains a copy of the ledger to ensure transparency and also prevent a single point of failure and all copies are updated and validated simultaneously. This makes it extremely difficult to manipulate entries or tamper with the data without the other parties noticing.</p>  </li>  <li>    <p><b><span style=\"color:green\">Immutable Records</span></b><br /> A third unique property is its immutability. By design, blockchains are inherently resistant to modification of data. All blockchain networks adhere to a certain protocol for validating new blocks. No changes can be made once the system is set with the initial standards. Once recorded, the data in any given block cannot be altered without the alteration of all the subsequent blocks, which requires the consensus of the network majority.</p>  </li></ul><p><b><span style=\"color:green\">Where will be blockchain hit on the Banks ??</span></b><br />Though blockchain is said to have an impact on virtually every aspect of the financial system, most disruptive use cases can be found in activities such as cross border payments and remittances, share trading, clearing and settlement, trade finance and supply chain finance, regulatory reporting and compliance, as well as smart contracts. It is however clear that when the technology further evolves there will be many more areas for applying the blockchain technologies emerging.</p><ol>  <li>    <p><b><span style=\"color:green\">Cross border payments</span></b><br />  It is not surprising that payments are emerging as the first and foremost blockchain use case of any banking and/or financial system. Nowadays payments across borders are a time-consuming and expensive process, given the need for correspondent banks or other intermediaries.</p>    <p>Blockchain offers an easy and secure solution, as it will not require third party authorization. . By cutting out many of the traditional middlemen, the laborious and costly process of cross border payments is simplified, thus significantly speeding up the cross-border payment process and that at a cost much less than with the traditional banking systems.</p>  </li>  <li>    <p><b><span style=\"color:green\">Share Trading</span></b><br />  Using blockchain for buying and selling stocks and shares could also bring several significant benefits. Share trading involves many third parties, such as brokers, CCPs, CSDs and exchanges, making this process time-consuming.</p>    <p>The decentralized nature of blockchain technology can remove all those intermediaries and enable trading to be run on computers all over the world. Eliminating some of the middlemen from the share trading process speeds up the settlement process and allows for greater trade accuracy. Trading transactions in blockchain thereby reduces the redundancy of information and thus improves performance.</p>  </li>  <li>    <p><b><span style=\"color:green\">Clearing and settlement</span></b><br />  The global cash settlement for fixed income, equity, and derivative products in various currencies is slow, costly, and complicated. Because of the large number of parties involved, It takes several days to settle.</p>    <p>By eliminating a large number of intermediaries, blockchain enables instantaneous settlement leading to substantially lower costs</p>  </li>  <li>    <p><b><span style=\"color:green\">Trade Finance</span></b><br />  Many trade finance activities still involve lots of paperwork, such as bills of lading, invoices, letters of credit etc. All participants in the trade chain must maintain their database for all transaction-related documents, that must be constantly reconciled against each other. It is as a result a time-consuming activity.</p>    <p>Blockchain-based trade finance can streamline the entire trading process by getting rid of this time-consuming paperwork and bureaucracy. It eliminates the need for several copies of the same document and can integrate all necessary information in one digital document, which is updated in real-time and can be accessed by all network members.</p>  </li>  <li>    <p><b><span style=\"color:green\">Digital Identity Verification</span></b><br />  Another area where customer experience could be significantly improved when using blockchain is in the digital identity verification process. Online financial transactions require a lot of steps to be taken, including face-to-face checking, authentication, authorization etc. All of these steps need to be taken for each new service provider.</p>    <p>Blockchain makes it possible to securely re-use identity verification for other services. With blockchain, users can choose how they identify themselves and with whom they agree to share their identity. They still need to register their identity on the blockchain, but they do not need to repeat the registration for each service provider if those providers are also powered by blockchain.</p>  </li>  <li>    <p><b><span style=\"color:green\">Smart Contracts</span></b><br />  Smart contracts are another way to fundamentally change the way business is done nowadays. The functions of a bank such as lending, deposits, treasury, investment advice, business intelligence, regulatory compliance, payments, and remittances will be disrupted by using these contracts.</p>    <p>Through the use of smart contracts, blockchain technology will change the way information and money are exchanged in finance (and in many other industries). Smart contracts enable operating and automating business processes in a fully decentralized fashion, enabling shared rules of engagement, conduct, and business processes to be automated and enforced ecosystem-wide.</p>  </li>  <li>    <p><b><span style=\"color:green\">Intensive collaboration</span></b><br />  The blockchain-based bank ecosystem will be one of intensive collaboration, within an increasingly open banking environment, not only with other banks but also with various third parties in the financial chain. Whether the third party is a payment processor, a fintech startup or a creative app developer.</p>    <p>Future success will depend on their willingness to co-operate – even with the apparent challengers to their core activities. Banks don’t have a choice in this – not if they want to survive and prosper. Although it might seem counterintuitive to banks to facilitate new services beyond their immediate control and balance sheets, standing in the way of external creativity and innovation carries the greater risk.</p>  </li>  <li>    <p><b><span style=\"color:green\">Bank-fintech partnerships</span></b><br />  Even as the disruptions continue, the ecosystem will see deeper collaboration between financial institutions and fintech firms and the creation of platform companies to meet the changing needs of their customers. While fintech companies have the advantage of innovation, financial institutions provide a sandbox for proof of concept and scale.</p>    <p>Most fintech start-ups lack several features for a stand-alone existence, that are well known for traditional banks. Fintech firms need to be wary of product functionality, flexibility, scalability and compliance. Banks have the advantages of greater resources and a larger scale. Good partnerships between banks and fintech could bring the best for both worlds.</p>  </li></ol><p>These are the domains in which banks could face the competition and could potentially lose ground against Blockchain technology and cryptocurrencies.</p><hr /><h4 id=\"references\">REFERENCES</h4><p>Carlo R.W. De Meijer. “Blockchain and Disruption in the Financial World: Will Banks Survive?” Blockchain and Disruption in the Financial World: Will Banks Survive?, Finextra, 12 Feb. 2019, https://www.finextra.com/blogposting/16658/blockchain-and-disruption-in-the-financial-world-will-banks-survive.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2020/12/01/how-blockchain-could-distupt-banking",
            
            
            
            
            
            "date_published": "2020-12-01T00:00:00-04:00",
            "date_modified": "2020-12-01T00:00:00-04:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/12/01/what-are-weaknes-of-blockchain",
            "title": "What is the weakness of Blockchain?? (Everything isn't perfect!!)",
            "summary": "Discuss the back draws of blockchain and explain them.",
            "content_text": "1. There is no customer protection on the blockchain Blockchain technology operates as a push-based settlement system. This means the individual holds power over the resource they want to verify on the blockchain. This could be in cryptos, certificate authentication, land titles, etc. The problem with this is if a transaction goes sour after it has already been verified on the blockchain, the only feasible way of returning the transaction is if the parties agree to reverse it. Using a  centralized system like a bank. However, there is a procedure in place to be able to dispute trades after they are complete. Some trade technologies that settle on a blockchain have used an arbiter system to fix this problem, an example of this is the Open Bazaar P2P  trade network. This way trade occurs between two people and one impartial moderator.2. Settlement on a blockchain is slow A  cost of settling a transaction on the blockchain is that all the nodes in the network need to come to an agreement that the transaction is valid. This is a far slower process than having a bank verify your transaction in an instant. Transactions can be made instantaneously, however until the block in which the transaction is inserted has been verified, it is classified as untrustworthy. In the time between a lodged transaction is made and when the block settles, a bad actor could launch fraudulent transactions to trick the network into what is known as double spend. A  very exciting upcoming technology that could solve this problem is the lightning network. This solution acts as layer 2 of blockchain technology; it can be applied to any public blockchain. It will enable instantly verified transactions for a fraction of the cost of today’s settlement.3. Miners can be selfish The mining process on the blockchain is an innovation that uses game theory economics to incentivize people to commit computer power for securing the network for a profit. The downside of this is generally miners won’t care about settling as many transactions as possible; they will make the most money by finding and verifying a block in the fastest way possible. This leads to a problem of miners finding empty blocks and validating. There is also another problem known as Selfish Mining, which is a situation where a miner or mining pool finds and validates a block and does not publish and distribute a valid solution to the rest of the network.4. The growing blockchain size  With  every new block, a blockchain grows. This can be an issue because each node that is validating the network needs to store the entire history of the blockchain to be a participant. This is a hard enough problem with the bitcoin blockchain where the transaction size is only a  few bytes, the total blockchain size as of January 2017 is 98GB. Given that at the same time in 2016 the size was 50GB, and the use of the blockchain is continuing to increase, this is a growing concern. One of the biggest debates in the bitcoin space is if the block size should be increased. If a blockchain has bigger blocks the blockchain size will increase faster, thus weeding out the solo miners eventually. This is a big issue because the health of a blockchain network is partially dependent on the number of nodes in the network, and the spread of those nodes across the world. The counterargument for this issue is that with sufficient advancement of technology hard disk space will be very cheap in the future and will stay ahead of the blockchain size. The debate is ongoing.5. Eventually, a settlement on the blockchain will not be cheap  On any public blockchain, space in a block is a finite resource.  Necessarily as the network is utilized more the amount of transactions that will want to settle in a block will exceed the storage capacity.  Public blockchain networks have a solution built-in for this which is that transactions with a higher miner fee attached will get precedence to be included in a block. This makes sense because the miners want to maximize their profit so that they will include transactions with the highest fees first. This is not a bug, but a feature. If it were free to settle on the blockchain, there would be far too many ways of attacking the blocks with dust transactions and clogging up the network. Originally the bitcoin blockchain had no block size limit; this was eventually set to  1MB to avoid a Sybil Attack on the network. All of these problems have potential solutions that can be implemented as a  fix. In my view, blockchains will eventually have layers of centralization like the lightning network. However, this is not a bad thing so long as there is a sufficient amount of encryption to protect the privacy of the people who want to use the centralized layers of the network.REFERENCESBlaetti, Robert. “5 Weak Points of Blockchain Technology.” Blockgeeks, 13 Jan. 2017, blockgeeks.com/public-blockchain/.‌",
            "content_html": "<p><b><span style=\"color:green\">1. There is no customer protection on the blockchain</span></b> Blockchain technology operates as a push-based settlement system. This means the individual holds power over the resource they want to verify on the blockchain. This could be in cryptos, certificate authentication, land titles, etc. The problem with this is if a transaction goes sour after it has already been verified on the blockchain, the only feasible way of returning the transaction is if the parties agree to reverse it. Using a  centralized system like a bank. However, there is a procedure in place to be able to dispute trades after they are complete. Some trade technologies that settle on a blockchain have used an arbiter system to fix this problem, an example of this is the Open Bazaar P2P  trade network. This way trade occurs between two people and one impartial moderator.</p><p><b><span style=\"color:green\">2. Settlement on a blockchain is slow</span></b> A  cost of settling a transaction on the blockchain is that all the nodes in the network need to come to an agreement that the transaction is valid. This is a far slower process than having a bank verify your transaction in an instant. Transactions can be made instantaneously, however until the block in which the transaction is inserted has been verified, it is classified as untrustworthy. In the time between a lodged transaction is made and when the block settles, a bad actor could launch fraudulent transactions to trick the network into what is known as double spend. A  very exciting upcoming technology that could solve this problem is the lightning network. This solution acts as layer 2 of blockchain technology; it can be applied to any public blockchain. It will enable instantly verified transactions for a fraction of the cost of today’s settlement.</p><p><b><span style=\"color:green\">3. Miners can be selfish </span></b>The mining process on the blockchain is an innovation that uses game theory economics to incentivize people to commit computer power for securing the network for a profit. The downside of this is generally miners won’t care about settling as many transactions as possible; they will make the most money by finding and verifying a block in the fastest way possible. This leads to a problem of miners finding empty blocks and validating. There is also another problem known as Selfish Mining, which is a situation where a miner or mining pool finds and validates a block and does not publish and distribute a valid solution to the rest of the network.</p><p><b><span style=\"color:green\">4. The growing blockchain size </span></b> With  every new block, a blockchain grows. This can be an issue because each node that is validating the network needs to store the entire history of the blockchain to be a participant. This is a hard enough problem with the bitcoin blockchain where the transaction size is only a  few bytes, the total blockchain size as of January 2017 is 98GB. Given that at the same time in 2016 the size was 50GB, and the use of the blockchain is continuing to increase, this is a growing concern. One of the biggest debates in the bitcoin space is if the block size should be increased. If a blockchain has bigger blocks the blockchain size will increase faster, thus weeding out the solo miners eventually. This is a big issue because the health of a blockchain network is partially dependent on the number of nodes in the network, and the spread of those nodes across the world. The counterargument for this issue is that with sufficient advancement of technology hard disk space will be very cheap in the future and will stay ahead of the blockchain size. The debate is ongoing.</p><p><b><span style=\"color:green\">5. Eventually, a settlement on the blockchain will not be cheap </span></b> On any public blockchain, space in a block is a finite resource.  Necessarily as the network is utilized more the amount of transactions that will want to settle in a block will exceed the storage capacity.  Public blockchain networks have a solution built-in for this which is that transactions with a higher miner fee attached will get precedence to be included in a block. This makes sense because the miners want to maximize their profit so that they will include transactions with the highest fees first. This is not a bug, but a feature. If it were free to settle on the blockchain, there would be far too many ways of attacking the blocks with dust transactions and clogging up the network. Originally the bitcoin blockchain had no block size limit; this was eventually set to  1MB to avoid a Sybil Attack on the network. All of these problems have potential solutions that can be implemented as a  fix. In my view, blockchains will eventually have layers of centralization like the lightning network. However, this is not a bad thing so long as there is a sufficient amount of encryption to protect the privacy of the people who want to use the centralized layers of the network.</p><p><br /></p><hr /><h4 id=\"references\">REFERENCES</h4><p>Blaetti, Robert. “5 Weak Points of Blockchain Technology.” Blockgeeks, 13 Jan. 2017, blockgeeks.com/public-blockchain/.</p><p>‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/12/01/what-are-weaknes-of-blockchain",
            
            
            
            
            
            "date_published": "2019-12-01T00:00:00-04:00",
            "date_modified": "2019-12-01T00:00:00-04:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud",
            "title": "What if we combine Blockchain and Cloud Computing?",
            "summary": "How the architecture of blockchain and cloud computing would be looking like.",
            "content_text": "Blockchain technology is distributed ledger with records of data containing all details of the transaction carried out and distributed among the nodes present in the network. All the transactions carried out previously are saved and then they are reflected in the next upcoming block hash. Hence it is an intangible and immutable data structure at the basic end.Cloud computing is well-defined technology that emerged from large-scale distributed computing technology. Cloud computing helps to reduce the burden on the resources and lets the user use the optimum resources for redundant work. Organizations like Google or Microsoft have large data servers and then the employees could get the required resources out of it. This helps the organization to have the flexibility of resources according to the projects.There are some evident issues in cloud computing which are Data Security, Data Management, Interoperability etc. By having the Blockchain concept with the cloud we could solve all of the issues or technical bottlenecks which we are facing at the moment with cloud computing. Blockchain technology is an emerging technology well known for its security and authenticity, which are the main characteristics that are making the world turn to its side. By integrating blockchain with cloud computing, there will be many advantages in usability, trust, security, scalability, data management, and many other advantages.There are several projects and Ideas which are working progressively in this direction, those are added in the references.REFERENCESC. V. N. U. B. Murthy, M. L. Shri, S. Kadry and S. Lim, “Blockchain Based Cloud Computing: Architecture and Research Challenges,” in IEEE Access, vol. 8, pp. 205190-205205, 2020, DOI: 10.1109/ACCESS.2020.3036812.Nate Nead, “Blockchain’s Next Frontier: Cloud Computing?,” InvestmentBank.com, 09-Jun-2018. [Online]. Available: https://investmentbank.com/blockchain-cloud-computing/. [Accessed: 17-Oct-2021]Anna, “Blockchain vs Cloud Computing: Best Features for Corporate Space,” Gbksoft.com, 05-May-2021. [Online]. Available: https://gbksoft.com/blog/blockchain-vs-cloud-best-features-for-corporate-space/. [Accessed: 17-Oct-2021]‌",
            "content_html": "<p>Blockchain technology is distributed ledger with records of data containing all details of the transaction carried out and distributed among the nodes present in the network. All the transactions carried out previously are <strong>saved and then they are reflected</strong> in the next upcoming block hash. Hence it is an <b><span style=\"color:green\">intangible and immutable</span></b> data structure at the basic end.</p><p>Cloud computing is well-defined technology that emerged from <strong>large-scale distributed computing technology</strong>. Cloud computing helps to reduce the burden on the resources and lets the user use the optimum resources for redundant work. Organizations like Google or Microsoft have large data servers and then the employees could get the required resources out of it. This helps the organization to have the flexibility of resources according to the projects.</p><p>There are some evident issues in cloud computing which are Data Security, Data Management, Interoperability etc. By having the Blockchain concept with the cloud we could solve all of the issues or <strong>technical bottlenecks</strong> which we are facing at the moment with cloud computing. Blockchain technology is an emerging technology well known for its <b><span style=\"color:green\">security and authenticity</span></b>, which are the main characteristics that are making the world turn to its side. By integrating blockchain with cloud computing, there will be many advantages in usability, trust, security, scalability, data management, and many other advantages.</p><p>There are several projects and Ideas which are working progressively in this direction, those are added in the references.</p><p><br /></p><hr /><h4 id=\"references\">REFERENCES</h4><p>C. V. N. U. B. Murthy, M. L. Shri, S. Kadry and S. Lim, “Blockchain Based Cloud Computing: Architecture and Research Challenges,” in IEEE Access, vol. 8, pp. 205190-205205, 2020, DOI: 10.1109/ACCESS.2020.3036812.</p><p>Nate Nead, “Blockchain’s Next Frontier: Cloud Computing?,” InvestmentBank.com, 09-Jun-2018. [Online]. Available: https://investmentbank.com/blockchain-cloud-computing/. [Accessed: 17-Oct-2021]</p><p>Anna, “Blockchain vs Cloud Computing: Best Features for Corporate Space,” Gbksoft.com, 05-May-2021. [Online]. Available: https://gbksoft.com/blog/blockchain-vs-cloud-best-features-for-corporate-space/. [Accessed: 17-Oct-2021]‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/10/31/what-if-we-combine-blockchain-and-cloud",
            
            
            
            
            
            "date_published": "2019-10-31T00:00:00-03:00",
            "date_modified": "2019-10-31T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/10/01/where-could-be-blockchain-used",
            "title": "Where could be Blockchain be used?",
            "summary": "where could be Blockchain be used?",
            "content_text": "Blockchain is freaking exciting and does have the potential to transform all of the business and how it operates, but that doesn’t mean it’s the right solution for every scenario. Here’s why you should choose blockchain  over, say, a standard outdated Centralized database:When you want to manage and secure digital relationships or keep a decentralized, shared system of record. Anytime you want to keep a long-term, transparent record of assets (for example, to record property or land rights ), publically available data, blockchain could be the ideal solution. Smart contracts, in particular, are great for facilitating digital relationships and transactions. With a solidity smart contract, automated payments can be released when parties in a  transaction agree that their conditions have been met.Anywhere a middleman or gatekeeper function is expensive or time-consuming. For  example, major cloud services nowadays allows user to pile up the data on the servers which are organized by a single body or corporate like Google or Amazon, these services charges immensely instead of the single data serves system we could use decentralized systems like DCS-BBN or SIA data systems which are backed by the blockchain and have an ecosystem of the hosts and consumers which provides storage for the rent on lower tariffsWhen you want to record secure transactions, especially between multiple partners. A  traditional database may be good for recording simple transactions between two parties, but when things get more complicated, blockchain can reduce bottlenecks and simplify relationships. For example, shipping conglomerate Maersk is working with IBM to develop a private blockchain platform to connect its various partners and customers across the shipping industry. What’s more, the added security of a decentralized system makes blockchain ideal for transactions in general.Where the data is in constant flux, but you want to keep a record of past actions.  Blockchain is a better, safer way to record the activity and keep data fresh while maintaining a record of its history. The data can’t be  corrupted by anyone or accidentally deleted, and you benefit from both a  historical trail of data, plus an instantly up-to-date recordREFERENCESBenjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.‌Benjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.",
            "content_html": "<p>Blockchain is freaking exciting and does have the potential to transform all of the business and how it operates, but that doesn’t mean it’s the right solution for every scenario. Here’s why you should choose blockchain  over, say, a standard outdated Centralized database:</p><p><b><span style=\"color:green\">When you want to manage and secure digital relationships or keep a decentralized, shared system of record.</span></b> Anytime you want to keep a long-term, transparent record of assets (for example, to record property or land rights ), publically available data, blockchain could be the ideal solution. Smart contracts, in particular, are great for facilitating digital relationships and transactions. With a solidity smart contract, automated payments can be released when parties in a  transaction agree that their conditions have been met.</p><p><b><span style=\"color:green\">Anywhere a middleman or gatekeeper function is expensive or time-consuming.</span></b> For  example, major cloud services nowadays allows user to pile up the data on the servers which are organized by a single body or corporate like Google or Amazon, these services charges immensely instead of the single data serves system we could use decentralized systems like DCS-BBN or SIA data systems which are backed by the blockchain and have an ecosystem of the hosts and consumers which provides storage for the rent on lower tariffs</p><p><b><span style=\"color:green\">When you want to record secure transactions, especially between multiple partners.</span></b> A  traditional database may be good for recording simple transactions between two parties, but when things get more complicated, blockchain can reduce bottlenecks and simplify relationships. For example, shipping conglomerate Maersk is working with IBM to develop a private blockchain platform to connect its various partners and customers across the shipping industry. What’s more, the added security of a decentralized system makes blockchain ideal for transactions in general.</p><p><b><span style=\"color:green\">Where the data is in constant flux, but you want to keep a record of past actions.</span></b>  Blockchain is a better, safer way to record the activity and keep data fresh while maintaining a record of its history. The data can’t be  corrupted by anyone or accidentally deleted, and you benefit from both a  historical trail of data, plus an instantly up-to-date record</p><hr /><h4 id=\"references\">REFERENCES</h4><p>Benjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.</p><p>‌Benjamin, Neeraj. “Why Blockchain Makes the Difference?” BitsNBlocks, Blockchain Technology, Cryptocurrency, Bitcoins, ICO, Bitcoin, Blockchain Basics, Learning Zone, Crypto Bank, 22 Feb. 2021, bitsnblocks.co/why-blockchain-makes-the-difference/.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/10/01/where-could-be-blockchain-used",
            
            
            
            
            
            "date_published": "2019-10-01T00:00:00-03:00",
            "date_modified": "2019-10-01T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/10/what-is-cryptocurrency-ico",
            "title": "What is the initial coin offering in Blockchain?",
            "summary": "This is the blog that describes how the Initial coin offering works, and how we need can host them to the exchanges.",
            "content_text": "An initial coin offering (ICO) or initial currency offering is a type of funding using cryptocurrencies. It is often a form of crowdfunding, although a private ICO which does not seek public investment is also possible. In an ICO, a quantity of cryptocurrency is sold in the form of “tokens” (“coins”) to speculators or investors, in exchange for legal tender or other (generally established and more stable) cryptocurrencies such as Bitcoin or Ether. The tokens are promoted as future functional units of currency if or when the ICO’s funding goal is met and the project successfully launchesKEY TAKEAWAYS&lt;/span&gt;&lt;/b&gt;  Initial Coin Offerings (ICOs) are a popular fundraising method used primarily by startups wishing to offer products and services, usually related to the cryptocurrency and blockchain space.  ICOs are similar to stocks, but they sometimes have utility for a software service or product offered.  Some ICOs have yielded massive returns for investors. Numerous others have turned out to be fraud or have failed or performed poorly.  To participate in an ICO, you will usually need to purchase a digital currency first and have a basic understanding of how to use cryptocurrency wallets and exchanges.  ICOs are, for the most part, completely unregulated, so investors must exercise a high degree of caution and diligence when researching and investing in ICOs.How an Initial Coin Offering (ICO) WorksWhen a cryptocurrency startup wants to raise money through ICO, it usually creates a whitepaper that outlines what the project is about, the need the project will fulfill upon completion, how much money is needed, how many of the virtual tokens the founders will keep, what type of money will be accepted, and how long the ICO campaign will run for.During the ICO campaign, enthusiasts and supporters of the project buy some of the project’s tokens with fiat or digital currency. These coins are referred to the buyers as tokens and are similar to shares of a company sold to investors during an IPO.If the money raised does not meet the minimum funds required by the firm, the money may be returned to the backers; at this point, the ICO would be deemed unsuccessful. If the funding requirements are met within the specified timeframe, the money raised is used to pursue the goals of the project.Special Considerations Investors looking to buy into ICOs should first familiarize themselves with the cryptocurrency space more broadly. In the case of most ICOs, investors must purchase tokens with pre-existing cryptocurrencies. This means that an ICO investor will need to already have a cryptocurrency wallet set up for a currency like bitcoin or ethereum, as well as having a wallet capable of holding whichever token or currency they want to purchase.How are ICOs regulated?ICOs are largely unregulated. In the United States, there aren’t any regulations that apply specifically to ICOs. However, if an ICO fits the classification of a securities offering, then it falls under the SEC’s jurisdiction and is regulated by federal securities laws.Some countries have taken a strict stance and banned ICOs entirely. Countries that have banned ICOs include China, Nepal, Bangladesh, Macedonia, Bolivia, and Ecuador.REFERENCES:            “What Is Blockchain Technology? - IBM Blockchain      IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.      Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.Wikipedia Contributors, “Initial coin offering,” Wikipedia, 08-Nov-2021. [Online]. Available: https://en.wikipedia.org/wiki/Initial_coin_offering. [Accessed: 08-Nov-2021]‌L. Daly, “What Is an Initial Coin Offering (ICO)?,” The Motley Fool, 12-Oct-2021. [Online]. Available: https://www.fool.com/investing/stock-market/market-sectors/financials/cryptocurrency-stocks/initial-coin-offering/. [Accessed: 08-Nov-2021]‌",
            "content_html": "<p>An <strong>initial coin offering (ICO)</strong> or initial currency offering is a type of funding using cryptocurrencies. It is often a form of crowdfunding, although a private ICO which does not seek public investment is also possible. In an ICO, a quantity of cryptocurrency is sold in the form of “tokens” (“coins”) to speculators or investors, in exchange for legal tender or other (generally established and more stable) cryptocurrencies such as <strong>Bitcoin or Ether</strong>. The tokens are promoted as future functional units of currency if or when the ICO’s funding goal is met and the project successfully launches</p><p>KEY TAKEAWAYS&lt;/span&gt;&lt;/b&gt;</p><ul>  <li>Initial Coin Offerings (ICOs) are a popular fundraising method used primarily by startups wishing to offer products and services, usually related to the cryptocurrency and blockchain space.</li>  <li>ICOs are similar to stocks, but they sometimes have utility for a software service or product offered.</li>  <li>Some ICOs have yielded massive returns for investors. Numerous others have turned out to be fraud or have failed or performed poorly.</li>  <li>To participate in an ICO, you will usually need to purchase a digital currency first and have a basic understanding of how to use cryptocurrency wallets and exchanges.</li>  <li>ICOs are, for the most part, completely unregulated, so investors must exercise a high degree of caution and diligence when researching and investing in ICOs.</li></ul><p><b><span style=\"color:green\">How an Initial Coin Offering (ICO) Works</span></b><br />When a cryptocurrency startup wants to raise money through ICO, it usually creates a whitepaper that outlines what the project is about, the need the project will fulfill upon completion, how much money is needed, how many of the virtual tokens the founders will keep, what type of money will be accepted, and how long the ICO campaign will run for.</p><p>During the ICO campaign, enthusiasts and supporters of the project buy some of the project’s tokens with fiat or digital currency. These coins are referred to the buyers as tokens and are similar to shares of a company sold to investors during an IPO.</p><p>If the money raised does not meet the minimum funds required by the firm, the money may be returned to the backers; at this point, the ICO would be deemed unsuccessful. If the funding requirements are met within the specified timeframe, the money raised is used to pursue the goals of the project.</p><p><b><span style=\"color:green\">Special Considerations </span></b><br />Investors looking to buy into ICOs should first familiarize themselves with the cryptocurrency space more broadly. In the case of most ICOs, investors must purchase tokens with pre-existing cryptocurrencies. This means that an ICO investor will need to already have a cryptocurrency wallet set up for a currency like bitcoin or ethereum, as well as having a wallet capable of holding whichever token or currency they want to purchase.</p><p><b><span style=\"color:green\">How are ICOs regulated?</span></b><br />ICOs are largely unregulated. In the United States, there aren’t any regulations that apply specifically to ICOs. However, if an ICO fits the classification of a securities offering, then it falls under the SEC’s jurisdiction and is regulated by federal securities laws.</p><p>Some countries have taken a strict stance and banned ICOs entirely. Countries that have banned ICOs include China, Nepal, Bangladesh, Macedonia, Bolivia, and Ecuador.</p><hr /><h4 id=\"references\">REFERENCES:</h4><table>  <tbody>    <tr>      <td>“What Is Blockchain Technology? - IBM Blockchain</td>      <td>IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</td>    </tr>  </tbody></table><p>Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>Wikipedia Contributors, “Initial coin offering,” Wikipedia, 08-Nov-2021. [Online]. Available: https://en.wikipedia.org/wiki/Initial_coin_offering. [Accessed: 08-Nov-2021]‌L. Daly, “What Is an Initial Coin Offering (ICO)?,” The Motley Fool, 12-Oct-2021. [Online]. Available: https://www.fool.com/investing/stock-market/market-sectors/financials/cryptocurrency-stocks/initial-coin-offering/. [Accessed: 08-Nov-2021]‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/10/what-is-cryptocurrency-ico",
            
            
            
            
            
            "date_published": "2019-09-10T00:00:00-03:00",
            "date_modified": "2019-09-10T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/09/what-is-cryptocurrency-atm",
            "title": "What are ATMs in Cryptocurrency and Blockchain?",
            "summary": "kiosks that allow a person to purchase Bitcoin and other cryptocurrencies by using cash or debit card.",
            "content_text": "Bitcoin ATMs (Automated Teller Machine) are kiosks that allows a person to purchase Bitcoin and other cryptocurrencies by using cash or debit card. Some Bitcoin ATMs offer bi-directional functionality enabling both the purchase of Bitcoin as well as the sale of Bitcoin for cash. In some cases, Bitcoin ATM providers require users to have an existing account to transact on the machine.There are two main types of Bitcoin machines  unidirectional (one-way)  bidirectional (two-way)Only about 30% of all crypto ATMs worldwide are bidirectional, and less than 23% in the U.S. Both types are connected to the Internet, allowing for cash purchase and/or sale of Bitcoin. Some machines use a paper receipt and others move money to a public key on the blockchain. Bitcoin cash kiosks look like traditional ATMs, but do not connect to a bank account and instead connect the user directly to a Bitcoin wallet or exchange. While some Bitcoin ATMs are traditional ATMs with revamped software, they do not require a bank account or debit card. On average, transaction fees are 10-20% but can go as high as 25% and as low as 7%.What Is a Bitcoin ATM?A bitcoin ATM is an Internet-connected kiosk that allows customers to purchase bitcoins and/or other cryptocurrencies with deposited cash.A bitcoin ATM is not the same as an automated teller machine (ATM) that allows bank customers to physically withdraw, deposit, or transfer funds in one’s bank account. Rather, bitcoin ATMs produce blockchain-based transactions that send cryptocurrencies to the user’s digital wallet, often via the use of a QR code.KEY TAKEAWAYSA bitcoin ATM is a standalone device or kiosk that allows members of the public to buy or sell bitcoin or other cryptocurrencies for a terminal.Bitcoin ATMs are connected to the Internet and often utilize QR codes to send and receive tokens to users’ digital wallets.There are currently more than 14,000 bitcoin ATMs in operation around the worldREFERENCES:            “What Is Blockchain Technology? - IBM Blockchain      IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.      Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.Wikipedia Contributors, “Bitcoin ATM,” Wikipedia, 29-Oct-2021. [Online]. Available: https://en.wikipedia.org/wiki/Bitcoin_ATM. [Accessed: 08-Nov-2021]‌“Bitcoin ATM,” Investopedia, 2021. [Online]. Available: https://www.investopedia.com/terms/b/bitcoin-atm.asp. [Accessed: 08-Nov-2021]‌",
            "content_html": "<p><b><span style=\"color:green\">Bitcoin ATMs (Automated Teller Machine)</span></b> are kiosks that allows a person to purchase Bitcoin and other cryptocurrencies by using cash or debit card. Some Bitcoin ATMs offer bi-directional functionality enabling both the purchase of Bitcoin as well as the sale of Bitcoin for cash. In some cases, Bitcoin ATM providers require users to have an existing account to transact on the machine.</p><p><b><span style=\"color:green\">There are two main types of Bitcoin machines</span></b><br /></p><ul>  <li>unidirectional (one-way)</li>  <li>bidirectional (two-way)</li></ul><p>Only about 30% of all crypto ATMs worldwide are bidirectional, and less than 23% in the U.S. Both types are connected to the Internet, allowing for cash purchase and/or sale of Bitcoin. Some machines use a paper receipt and others move money to a public key on the blockchain. Bitcoin cash kiosks look like traditional ATMs, but do not connect to a bank account and instead connect the user directly to a Bitcoin wallet or exchange. While some Bitcoin ATMs are traditional ATMs with revamped software, they do not require a bank account or debit card. On average, transaction fees are 10-20% but can go as high as 25% and as low as 7%.</p><p><b><span style=\"color:green\">What Is a Bitcoin ATM?</span></b><br />A bitcoin ATM is an Internet-connected kiosk that allows customers to purchase bitcoins and/or other cryptocurrencies with deposited cash.</p><p>A bitcoin ATM is not the same as an automated teller machine (ATM) that allows bank customers to physically withdraw, deposit, or transfer funds in one’s bank account. Rather, bitcoin ATMs produce blockchain-based transactions that send cryptocurrencies to the user’s digital wallet, often via the use of a QR code.</p><p><b><span style=\"color:green\">KEY TAKEAWAYS</span></b><br />A bitcoin ATM is a standalone device or kiosk that allows members of the public to buy or sell bitcoin or other cryptocurrencies for a terminal.Bitcoin ATMs are connected to the Internet and often utilize QR codes to send and receive tokens to users’ digital wallets.There are currently more than 14,000 bitcoin ATMs in operation around the world</p><hr /><h4 id=\"references\">REFERENCES:</h4><table>  <tbody>    <tr>      <td>“What Is Blockchain Technology? - IBM Blockchain</td>      <td>IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</td>    </tr>  </tbody></table><p>Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>Wikipedia Contributors, “Bitcoin ATM,” Wikipedia, 29-Oct-2021. [Online]. Available: https://en.wikipedia.org/wiki/Bitcoin_ATM. [Accessed: 08-Nov-2021]‌“Bitcoin ATM,” Investopedia, 2021. [Online]. Available: https://www.investopedia.com/terms/b/bitcoin-atm.asp. [Accessed: 08-Nov-2021]‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/09/what-is-cryptocurrency-atm",
            
            
            
            
            
            "date_published": "2019-09-09T00:00:00-03:00",
            "date_modified": "2019-09-09T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/08/what-is-automativ-swaps-in-blockchain",
            "title": "Automatic Swaps in Blockchain",
            "summary": "This blog will contain information regarding the automatic swaps in Blockchain.",
            "content_text": "An atomic swap is a smart contract technology that enables the exchange of one cryptocurrency for another without using centralized intermediaries, such as exchanges.Atomic swaps can take place directly between blockchains of different cryptocurrencies, or they can be conducted off-chain, away from the main blockchain. They first came into prominence in September 2017, when an atomic swap between Decred and Litecoin was conducted.Since then, other startups and decentralized exchanges have allowed users the same facility. For example, Lightning Labs, a startup that uses bitcoin’s lightning network for transactions, has conducted off-chain swaps using the technology.Cryptocurrencies and decentralized exchanges, such as 0x and Altcoin.io, have also incorporated the technology.How do atomic swaps work?Atomic swap protocols are designed in a way that prevents any of the involved parties from cheating. To understand how they work, let’s imagine that Alice wants to trade her Litecoins (LTC) for Bob’s Bitcoins (BTC).First, Alice deposits her LTC into a contract address that acts like a safe. When this safe is created, Alice also generates a key to access it. She then shares a cryptographic hash of this key with Bob. Note that Bob can’t access the LTC yet because he only has the hash of the key and not the key itself.Next, Bob uses the hash provided by Alice to create another safe contract address, in which he deposits his BTC. To claim the BTC, Alice is required to use that same key and, by doing so, she reveals it to Bob (thanks to a special function called hash lock). This means that as soon as Alice claims the BTC, Bob can claim the LTC and the swap is complete.The term ‘atomic’ relates to the fact that these transactions either happen entirely or not at all. If any of the parties give up or fail to do what they are supposed to, the contract is cancelled, and the funds are automatically returned to their owners.Atomic swaps can happen in two different ways: on-chain and off-chain. On-chain atomic swaps happen on either of the currency’s networks (in this case, either the Bitcoin or Litecoin blockchain). Off-chain atomic swaps, on the other hand, take place on a secondary layer. This kind of atomic swap is usually based on bidirectional payment channels, similar to the ones used in the Lightning Network.Technically speaking, most of these trustless trading systems are based on smart contracts that use multi-signatures and Hash Timelock Contracts (HTLC).Hash Timelock Contracts (HTLC)While Hash Timelock Contracts (HTLC) are an important part of the Bitcoin Lightning Network, they are also one of the key components that makes atomic swaps possible. As the name suggests, they are based on two key functions: a hash lock and a timelock.A hash lock is what prevents funds from being spent unless a piece of data is revealed (Alice’s key in the previous example). Timelock is a function that ensures the contract can only be executed within a predefined timeframe. Consequently, the use of HTLCs removes the need for trust because they create a specific set of rules that prevent atomic swaps from executing partially.AdvantagesThe biggest advantages of atomic swaps are all related to their decentralized nature. By removing the need for a centralized exchange or any other kind of mediator, cross-chain swaps can be executed by two (or more) parties without requiring them to trust each other. There is also an increased level of security because users don’t need to give their funds to a centralized exchange or third party. Instead, the trades can happen directly from users’ wallets.Also, this form of peer-to-peer trading has much lower operational costs as trading fees are either very low or absent. Lastly, atomic swaps make it possible for trades to happen very quickly, with higher degrees of interoperability. In other words, altcoins can be swapped directly without making use of Bitcoin or Ethereum as an intermediary coin.LimitationsThere are a few conditions that need to be met for an atomic swap to take place, and these may likely present obstacles for the technique to be widely adopted. For instance, to perform an atomic swap, the two cryptocurrencies need to be based on blockchains that share the same hashing algorithm (e.g., SHA-256 for Bitcoin). They also need to be compatible with HTLC and other programmable functionalities.Other than that, atomic swaps bring up concerns about user’s privacy. That’s because on-chain swaps and transactions can be quickly tracked on a blockchain explorer, making it easy to link the addresses. A short-term answer to this problem is to use privacy-focused cryptocurrencies as a way to reduce exposure. Still, many developers are experimenting with the use of digital signatures in atomic swaps as a more reliable solution.REFERENCES:            “What Is Blockchain Technology? - IBM Blockchain      IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌‌      Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.“What Are Atomic Swaps?,” Investopedia, 2021. [Online]. Available: https://www.investopedia.com/terms/a/atomic-swaps.asp. [Accessed: 08-Nov-2021]Navdeep Kaur Marwah, “Now, kids and teens in Bigg Boss?,” Hindustan Times, 28-Aug-2012. [Online]. Available: https://www.hindustantimes.com/tv/now-kids-and-teens-in-bigg-boss/story-0Dol8bhaaqMi6Hh21RVh8N.html. [Accessed: 08-Nov-2021]‌‌",
            "content_html": "<p>An atomic swap is a smart contract technology that enables the exchange of one cryptocurrency for another without using centralized intermediaries, such as exchanges.</p><p>Atomic swaps can take place directly between blockchains of different cryptocurrencies, or they can be conducted off-chain, away from the main blockchain. They first came into prominence in September 2017, when an atomic swap between Decred and Litecoin was conducted.</p><p>Since then, other startups and decentralized exchanges have allowed users the same facility. For example, Lightning Labs, a startup that uses bitcoin’s lightning network for transactions, has conducted off-chain swaps using the technology.</p><p>Cryptocurrencies and decentralized exchanges, such as 0x and Altcoin.io, have also incorporated the technology.</p><p><b><span style=\"color:green\">How do atomic swaps work?</span></b><br />Atomic swap protocols are designed in a way that prevents any of the involved parties from cheating. To understand how they work, let’s imagine that Alice wants to trade her Litecoins (LTC) for Bob’s Bitcoins (BTC).</p><p>First, Alice deposits her LTC into a contract address that acts like a safe. When this safe is created, Alice also generates a key to access it. She then shares a cryptographic hash of this key with Bob. Note that Bob can’t access the LTC yet because he only has the hash of the key and not the key itself.Next, Bob uses the hash provided by Alice to create another safe contract address, in which he deposits his BTC. To claim the BTC, Alice is required to use that same key and, by doing so, she reveals it to Bob (thanks to a special function called hash lock). This means that as soon as Alice claims the BTC, Bob can claim the LTC and the swap is complete.The term ‘atomic’ relates to the fact that these transactions either happen entirely or not at all. If any of the parties give up or fail to do what they are supposed to, the contract is cancelled, and the funds are automatically returned to their owners.</p><p>Atomic swaps can happen in two different ways: on-chain and off-chain. On-chain atomic swaps happen on either of the currency’s networks (in this case, either the Bitcoin or Litecoin blockchain). Off-chain atomic swaps, on the other hand, take place on a secondary layer. This kind of atomic swap is usually based on bidirectional payment channels, similar to the ones used in the Lightning Network.Technically speaking, most of these trustless trading systems are based on smart contracts that use multi-signatures and Hash Timelock Contracts (HTLC).</p><p><b><span style=\"color:green\">Hash Timelock Contracts (HTLC)</span></b><br />While Hash Timelock Contracts (HTLC) are an important part of the Bitcoin Lightning Network, they are also one of the key components that makes atomic swaps possible. As the name suggests, they are based on two key functions: a hash lock and a timelock.A hash lock is what prevents funds from being spent unless a piece of data is revealed (Alice’s key in the previous example). Timelock is a function that ensures the contract can only be executed within a predefined timeframe. Consequently, the use of HTLCs removes the need for trust because they create a specific set of rules that prevent atomic swaps from executing partially.</p><p><b><span style=\"color:green\">Advantages</span></b><br />The biggest advantages of atomic swaps are all related to their decentralized nature. By removing the need for a centralized exchange or any other kind of mediator, cross-chain swaps can be executed by two (or more) parties without requiring them to trust each other. There is also an increased level of security because users don’t need to give their funds to a centralized exchange or third party. Instead, the trades can happen directly from users’ wallets.Also, this form of peer-to-peer trading has much lower operational costs as trading fees are either very low or absent. Lastly, atomic swaps make it possible for trades to happen very quickly, with higher degrees of interoperability. In other words, altcoins can be swapped directly without making use of Bitcoin or Ethereum as an intermediary coin.</p><p><b><span style=\"color:green\">Limitations</span></b><br />There are a few conditions that need to be met for an atomic swap to take place, and these may likely present obstacles for the technique to be widely adopted. For instance, to perform an atomic swap, the two cryptocurrencies need to be based on blockchains that share the same hashing algorithm (e.g., SHA-256 for Bitcoin). They also need to be compatible with HTLC and other programmable functionalities.Other than that, atomic swaps bring up concerns about user’s privacy. That’s because on-chain swaps and transactions can be quickly tracked on a blockchain explorer, making it easy to link the addresses. A short-term answer to this problem is to use privacy-focused cryptocurrencies as a way to reduce exposure. Still, many developers are experimenting with the use of digital signatures in atomic swaps as a more reliable solution.</p><hr /><h4 id=\"references\">REFERENCES:</h4><table>  <tbody>    <tr>      <td>“What Is Blockchain Technology? - IBM Blockchain</td>      <td>IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌‌</td>    </tr>  </tbody></table><p>Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>“What Are Atomic Swaps?,” Investopedia, 2021. [Online]. Available: https://www.investopedia.com/terms/a/atomic-swaps.asp. [Accessed: 08-Nov-2021]</p><p>Navdeep Kaur Marwah, “Now, kids and teens in Bigg Boss?,” Hindustan Times, 28-Aug-2012. [Online]. Available: https://www.hindustantimes.com/tv/now-kids-and-teens-in-bigg-boss/story-0Dol8bhaaqMi6Hh21RVh8N.html. [Accessed: 08-Nov-2021]‌‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/08/what-is-automativ-swaps-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-08T00:00:00-03:00",
            "date_modified": "2019-09-08T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/07/what-is-exchanges-in-blockchain",
            "title": "What are Crypto Exchanges?",
            "summary": "What is the Blockchain?",
            "content_text": "What are Cryptocurrency Exchanges?A crypto exchange is a platform on which you can buy and sell cryptocurrency. You can use exchanges to trade one crypto for another — converting Bitcoin to Litecoin, for example — or to buy crypto using regular currency, like the U.S. Dollar. Exchanges reflect current market prices of the cryptocurrencies they offer. You can also convert cryptocurrencies back into the U.S. Dollar or another currency on an exchange, to leave as cash within your account (if you want to trade back into crypto later) or withdraw to your regular bank account.Cryptocurrency exchanges are online platforms in which you can exchange one kind of digital asset for another based on the market value of the given assets. The most popular exchanges are currently Binance and GDAX. It is important not to confuse cryptocurrency exchanges for cryptocurrency wallets or wallet brokerages. Cryptocurrency wallets and wallet brokerages generally allow you to buy and sell a small range of popular digital assets (Bitcoin and Ethereum), which you can then send to a different exchange to trade for other digital assets like altcoins. This statement is not entirely exclusive though; most cryptocurrency exchanges will usually limit their users to only trade digital assets for digital assets, but a few allow trades of fiat currencies such as U.S. Dollars for cryptocurrencies. An example of such an exchange is Kraken, which currently accepts funds in the form of USD, JPY, CAD, and GBP, and supports trades with Monero, Ripple, and Litecoin as well as Bitcoin and Ethereum.There’s no one crypto exchange that’s best for every user, says Tyrone Ross, a financial advisor and CEO of Onramp Invest, a crypto investment platform for financial advisors. Instead, he says it helps to evaluate your own interests when it comes to crypto, and find an exchange that aligns with your goals. For example, maybe you’re looking for a specific coin, or you want to continue learning more as you get into crypto investing.Things to look for in Crypto Exchanges.  Accessibility  Security  Fees  Liquidity  Coins offered  Educational tools  Storage  Tax informationThese are some of the points which should be took in the consideration while choosing the appropriate crypto wallet to buy Crypto currencies.REFERENCES:“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.“Want to Buy Crypto? Here’s What to Look for in a Crypto Exchange.” NextAdvisor with TIME, 11 June 2021, time.com/nextadvisor/investing/cryptocurrency/what-are-cryptocurrency-exchanges/.‌Wikipedia Contributors. “Cryptocurrency Exchange.” Wikipedia, Wikimedia Foundation, 19 Oct. 2021, en.wikipedia.org/wiki/Cryptocurrency_exchange.‌Ethos. “What Are Cryptocurrency Exchanges?” Ethos, Ethos.io PTE LTD, 26 Apr. 2018, www.ethos.io/what-are-cryptocurrency-exchanges/.‌",
            "content_html": "<p><b><span style=\"color:green\">What are Cryptocurrency Exchanges?</span></b><br /></p><p><span style=\"color:green\">A crypto exchange is a platform on which you can buy and sell cryptocurrency.</span> You can use exchanges to trade one crypto for another — converting Bitcoin to Litecoin, for example — or to buy crypto using regular currency, like the U.S. Dollar. Exchanges reflect current market prices of the cryptocurrencies they offer. You can also convert cryptocurrencies back into the U.S. Dollar or another currency on an exchange, to leave as cash within your account (if you want to trade back into crypto later) or withdraw to your regular bank account.</p><p>Cryptocurrency exchanges are online platforms in which you can exchange one kind of digital asset for another based on the market value of the given assets. The most popular exchanges are currently Binance and GDAX. It is important not to confuse cryptocurrency exchanges for cryptocurrency wallets or wallet brokerages. Cryptocurrency wallets and wallet brokerages generally allow you to buy and sell a small range of popular digital assets (Bitcoin and Ethereum), which you can then send to a different exchange to trade for other digital assets like altcoins. This statement is not entirely exclusive though; most cryptocurrency exchanges will usually limit their users to only trade digital assets for digital assets, but a few allow trades of fiat currencies such as U.S. Dollars for cryptocurrencies. An example of such an exchange is Kraken, which currently accepts funds in the form of USD, JPY, CAD, and GBP, and supports trades with Monero, Ripple, and Litecoin as well as Bitcoin and Ethereum.</p><p><span style=\"color:green\">There’s no one crypto exchange that’s best for every user,</span> says Tyrone Ross, a financial advisor and CEO of Onramp Invest, a crypto investment platform for financial advisors. Instead, he says it helps to evaluate your own interests when it comes to crypto, and find an exchange that aligns with your goals. For example, maybe you’re looking for a specific coin, or you want to continue learning more as you get into crypto investing.</p><p><b><span style=\"color:green\">Things to look for in Crypto Exchanges.</span></b><br /></p><ul>  <li>Accessibility</li>  <li>Security</li>  <li>Fees</li>  <li>Liquidity</li>  <li>Coins offered</li>  <li>Educational tools</li>  <li>Storage</li>  <li>Tax information</li></ul><p>These are some of the points which should be took in the consideration while choosing the appropriate crypto wallet to buy Crypto currencies.</p><hr /><h4 id=\"references\">REFERENCES:</h4><p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</p><p>‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>“Want to Buy Crypto? Here’s What to Look for in a Crypto Exchange.” NextAdvisor with TIME, 11 June 2021, time.com/nextadvisor/investing/cryptocurrency/what-are-cryptocurrency-exchanges/.</p><p>‌Wikipedia Contributors. “Cryptocurrency Exchange.” Wikipedia, Wikimedia Foundation, 19 Oct. 2021, en.wikipedia.org/wiki/Cryptocurrency_exchange.</p><p>‌Ethos. “What Are Cryptocurrency Exchanges?” Ethos, Ethos.io PTE LTD, 26 Apr. 2018, www.ethos.io/what-are-cryptocurrency-exchanges/.</p><p>‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/07/what-is-exchanges-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-07T00:00:00-03:00",
            "date_modified": "2019-09-07T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/06/what-is-transaction-fees-in-blockchain",
            "title": "What is Transaction Fees in Blockchain?",
            "summary": "The blockchain fee is a cryptocurrency transaction fee that is charged to users when performing crypto transactions. The fee is collected in order to process the transaction on the network.",
            "content_text": "The blockchain fee is a cryptocurrency transaction fee that is charged to users when performing crypto transactions. The fee is collected in order to process the transaction on the network.You need to pay the blockchain fee to ensure your cryptocurrency transfers arrive in a timely manner. The blockchain fee is one of the main tools used to speed up crypto transactions, which are often slow due to high congestion on the blockchain network. The lower the blockchain fee, the lower your transaction’s priority in the blockchain network.Transaction fees for cryptocurrency depend mainly on the supply of network capacity at the time, versus the demand from the currency holder for a faster transaction. The currency holder can choose a specific transaction fee, while network entities process transactions in order of highest offered fee to lowest. Cryptocurrency exchanges can simplify the process for currency holders by offering priority alternatives and thereby determine which fee will likely cause the transaction to be processed in the requested time.For ether, transaction fees differ by computational complexity, bandwidth use, and storage needs, while bitcoin transaction fees differ by transaction size and whether the transaction uses SegWit. In September 2018, the median transaction fee for ether corresponded to $0.017, while for bitcoin it corresponded to $0.55.Some cryptocurrencies have no transaction fees, and instead rely on client-side proof-of-work as the transaction prioritization and anti-spam mechanism.REFERENCES:“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.Binance Academy. “What Are Blockchain Transaction Fees?” Binance Academy, Binance Academy, 15 Mar. 2021, academy.binance.com/en/articles/what-are-blockchain-transaction-fees.‌“Transaction-Fees.” Blockchain.com, 2016, www.blockchain.com/charts/transaction-fees.‌“What Is the Blockchain Fee?” Wirexapp.com, 2021, wirexapp.com/help/article/what-is-the-blockchain-fee-0078.‌Wikipedia Contributors. “Cryptocurrency.” Wikipedia, Wikimedia Foundation, 9 Nov. 2021, en.wikipedia.org/wiki/Cryptocurrency.",
            "content_html": "<p>The blockchain fee is a cryptocurrency transaction fee that is <b><span style=\"color:green\">charged to users when performing crypto transactions.</span></b> The fee is collected in order to process the transaction on the network.</p><p>You need to pay the blockchain fee to ensure your cryptocurrency transfers arrive in a timely manner. The blockchain fee is <b><span style=\"color:green\">one of the main tools used to speed up crypto transactions,</span></b> which are often slow due to high congestion on the blockchain network. The lower the blockchain fee, the lower your transaction’s priority in the blockchain network.</p><p>Transaction fees for cryptocurrency depend mainly on the <b><span style=\"color:green\">supply of network capacity at the time,</span></b> versus the demand from the currency holder for a faster transaction. The currency holder can choose a specific transaction fee, while network entities process transactions in order of highest offered fee to lowest. Cryptocurrency exchanges can simplify the process for currency holders by offering priority alternatives and thereby determine which fee will likely cause the transaction to be processed in the requested time.</p><p>For ether, transaction fees differ by computational complexity, bandwidth use, and storage needs, while bitcoin transaction fees differ by transaction size and whether the transaction uses SegWit. <b><span style=\"color:green\">In September 2018, the median transaction fee for ether corresponded to $0.017, while for bitcoin it corresponded to $0.55.</span></b></p><p>Some cryptocurrencies have no transaction fees, and instead rely on client-side proof-of-work as the transaction prioritization and anti-spam mechanism.</p><hr /><h4 id=\"references\">REFERENCES:</h4><p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</p><p>‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>Binance Academy. “What Are Blockchain Transaction Fees?” Binance Academy, Binance Academy, 15 Mar. 2021, academy.binance.com/en/articles/what-are-blockchain-transaction-fees.</p><p>‌“Transaction-Fees.” Blockchain.com, 2016, www.blockchain.com/charts/transaction-fees.</p><p>‌“What Is the Blockchain Fee?” Wirexapp.com, 2021, wirexapp.com/help/article/what-is-the-blockchain-fee-0078.</p><p>‌Wikipedia Contributors. “Cryptocurrency.” Wikipedia, Wikimedia Foundation, 9 Nov. 2021, en.wikipedia.org/wiki/Cryptocurrency.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/06/what-is-transaction-fees-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-06T00:00:00-03:00",
            "date_modified": "2019-09-06T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/05/what-is-anonimity-in-blockchain",
            "title": "Why blockchain is portrayed as anonymous?",
            "summary": "This blog represents the information regarding the issue of anonymity in terms of blockchain",
            "content_text": "Blockchain is public for all but the information saved in the blockchain is not public for all the users as it comes up with SHA encryption and the information is only accessed while verification of the data by the legitimacy miners only.Thinking about anonymity in the terms of Blockchain and cryptocurrency we could look for some points listed below.The only thing to take in the consideration is,  BLOCKCHAIN AREN”T ANONYMOUS BUT THEY ARE PSEDUONYMOUS! Similar to how authors will sometimes write under a pseudonym, you send and receive cryptocurrency using a pseudonym. Instead of a fictitious name, though, your blockchain pseudonym is your public address. This long string of numbers and letters doesn’t contain any identifiable information that would tie you to the address or its associated wallet.Consider a public hash of 32 bit like, 567sdf89h..v56eg4 this and this is available publically in the blockchain domain but no one could undermine that what this means!Because the complicated addresses mask your identity, many people think that activity on a blockchain is anonymous. While public addresses protect your privacy to some extent, other blockchain features tend to expose youREFERENCES:“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.",
            "content_html": "<p>Blockchain is public for all but the information saved in the blockchain is not public for all the users as it comes up with SHA encryption and the information is only accessed while verification of the data by the legitimacy miners only.</p><p>Thinking about anonymity in the terms of Blockchain and cryptocurrency we could look for some points listed below.</p><p>The only thing to take in the consideration is,</p><blockquote>  <p><em><b><span style=\"color:green\">BLOCKCHAIN AREN”T ANONYMOUS BUT THEY ARE PSEDUONYMOUS! </span></b></em></p></blockquote><p>Similar to how authors will sometimes write under a pseudonym, you send and receive cryptocurrency using a pseudonym. Instead of a fictitious name, though, your blockchain pseudonym is your public address. This long string of numbers and letters doesn’t contain any identifiable information that would tie you to the address or its associated wallet.</p><p>Consider a public hash of 32 bit like, 567sdf89h..v56eg4 this and this is available publically in the blockchain domain but no one could undermine that what this means!</p><p>Because the complicated addresses mask your identity, many people think that activity on a blockchain is anonymous. While public addresses protect your privacy to some extent, other blockchain features tend to expose you</p><hr /><h4 id=\"references\">REFERENCES:</h4><p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</p><p>‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/05/what-is-anonimity-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-05T00:00:00-03:00",
            "date_modified": "2019-09-05T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/04/what-is-wallet-in-blockchain",
            "title": "What are Crypto wallets in Blockchan and Cryptocurrencies ?",
            "summary": "A crypto wallet is a software program or physical device that allows you to store your crypto and allow for the sending and receiving of crypto transactions. A crypto wallet consists of two key pairs private keys and public keys. A public key is derived from the private key and serves as the address used to send crypto to the wallet.",
            "content_text": "Crypto wallets keep your private keys – the passwords that give you access to your cryptocurrencies – safe and accessible, allowing you to send and receive cryptocurrencies like Bitcoin and Ethereum. They come in many forms, from hardware wallets like Ledger (which looks like a USB stick) to mobile apps like Coinbase Wallet, which makes using crypto as easy as shopping with a credit card online.Going in depth we could signify the defination for the crypto wallets like, “Crypto wallets store your private keys, keeping your crypto safe and accessible. They also allow you to send, receive, and spend cryptocurrencies like Bitcoin and Ethereum.”Understanding how crypto wallets work Blockchain is a public ledger that stores data in what’s known as “blocks.” These are records of all transactions, the balances held at any given address, and who holds the key to those balances. Crypto isn’t stored “in” a wallet, per se. The coins exist on a blockchain and the wallet software allows you to interact with the balances held on that blockchain. The wallet itself stores addresses and allows their owners to move coins elsewhere while also letting others see the balance held at any given address.“Most Crypto wallets allow users to send, receive, and store crypto. Some have a feature to buy and spend cryptocurrencies,” says Utsav Dar, co-founder of Incub8 Finance. “Certain crypto wallets have additional features like swapping between tokens, staking tokens for a fixed return paid out to users, as well as access to dApps (decentralized applications) built on various networks.”While each wallet has its own specific nuances, here are the general steps involved in sending or receiving funds using a crypto wallet:      To receive funds, you need to retrieve an address (also known as a public key) from your wallet. Locate the “generate address” feature in your wallet, click it, then copy the alphanumeric address or QR code and share it with the person who wants to send you crypto.        To send funds, you need the address of the receiving wallet. Locate the “send” feature in your wallet and enter an address of the wallet you intend to send coins to. Select the amount of crypto you’d like to send, and click “confirm.” Consider sending a small test transaction before sending large amounts of crypto. Note that sending coins requires a fee that will be paid to miners in exchange for processing the transaction.  Sending money via QR codes or long strings of numbers and letters may seem strange at first. But after doing it a few times, the process becomes quite simple.How do you use a crypto wallet?Crypto wallets range from simple-to-use apps to more complex security solutions. The main types of wallets you can choose from include:Paper wallets: Keys are written on a physical medium like paper and stored in a safe place. This of course makes using your crypto harder, because as digital money it can only be used on the internet.Hardware wallets: Keys are stored in a thumb-drive device that is kept in a safe place and only connected to a computer when you want to use your crypto. The idea is to try to balance security and convenience.Online wallets: Keys are stored in an app or other software – look for one that is protected by two-step encryption. This makes sending, receiving, and using your crypto as easy as using any online bank account, payment system, or brokerage.Each type has its tradeoffs. Paper and hardware wallets are harder for malicious users to access because they are stored offline, but they are limited in function and risk being lost or destroyed. Online wallets offered by a major exchange like Coinbase are the simplest way to get started in crypto and offer a balance of security and easy access. (Because your private info is online, your protection against hackers is only as good as your wallet provider’s security – so make sure you look for features like two-factor verification.)What could be done with the help of Crypto Wallets  Manage all your digital assets in one secure place  Control your own private keys  Send and receive cryptocurrency to and from anywhere in the world  Interact with usernames rather than long, hexadecimal “public key” addresses  Browse dapps (decentralized finance apps)  Shop at stores that accept cryptocurrencyREFERENCES:      “What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌        Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.        “What Is a Crypto Wallet?” @Coinbase, Coinbase, 2021, www.coinbase.com/learn/crypto-basics/what-is-a-crypto-wallet.        Wikipedia Contributors. “Cryptocurrency Wallet.” Wikipedia, Wikimedia Foundation, 4 Nov. 2021, en.wikipedia.org/wiki/Cryptocurrency_wallet.        Nibley, Brian. “What Is a Crypto Wallet? How It Works &amp; If You Need One.” Business Insider, Business Insider, 28 Oct. 2021, www.businessinsider.com/crypto-wallet.  ",
            "content_html": "<p>Crypto wallets keep your private keys – the passwords that give you access to your cryptocurrencies – safe and accessible, allowing you to send and receive cryptocurrencies like Bitcoin and Ethereum. They come in many forms, from hardware wallets like Ledger (which looks like a USB stick) to mobile apps like Coinbase Wallet, which makes using crypto as easy as shopping with a credit card online.</p><p>Going in depth we could signify the defination for the crypto wallets like, <span style=\"color:green\"><em>“Crypto wallets store your private keys, keeping your crypto safe and accessible. They also allow you to send, receive, and spend cryptocurrencies like Bitcoin and Ethereum.”</em></span></p><p><b><span style=\"color:green\">Understanding how crypto wallets work </span></b><br />Blockchain is a public ledger that stores data in what’s known as “blocks.” These are records of all transactions, the balances held at any given address, and who holds the key to those balances. Crypto isn’t stored “in” a wallet, per se. The coins exist on a blockchain and the wallet software allows you to interact with the balances held on that blockchain. The wallet itself stores addresses and allows their owners to move coins elsewhere while also letting others see the balance held at any given address.</p><p><em>“Most Crypto wallets allow users to send, receive, and store crypto. Some have a feature to buy and spend cryptocurrencies,”</em> says Utsav Dar, co-founder of Incub8 Finance. <em>“Certain crypto wallets have additional features like swapping between tokens, staking tokens for a fixed return paid out to users, as well as access to dApps (decentralized applications) built on various networks.”</em></p><p>While each wallet has its own specific nuances, here are the general steps involved in sending or receiving funds using a crypto wallet:</p><ul>  <li>    <p><b><span style=\"color:green\">To receive funds,</span></b> you need to retrieve an address (also known as a public key) from your wallet. Locate the “generate address” feature in your wallet, click it, then copy the alphanumeric address or QR code and share it with the person who wants to send you crypto.</p>  </li>  <li>    <p><b><span style=\"color:green\">To send funds,</span></b> you need the address of the receiving wallet. Locate the “send” feature in your wallet and enter an address of the wallet you intend to send coins to. Select the amount of crypto you’d like to send, and click “confirm.” Consider sending a small test transaction before sending large amounts of crypto. Note that sending coins requires a fee that will be paid to miners in exchange for processing the transaction.</p>  </li></ul><p>Sending money via QR codes or long strings of numbers and letters may seem strange at first. But after doing it a few times, the process becomes quite simple.</p><p><b><span style=\"color:green\">How do you use a crypto wallet?</span></b><br />Crypto wallets range from simple-to-use apps to more complex security solutions. The main types of wallets you can choose from include:</p><p><b><span style=\"color:green\">Paper wallets:</span></b> Keys are written on a physical medium like paper and stored in a safe place. This of course makes using your crypto harder, because as digital money it can only be used on the internet.</p><p><b><span style=\"color:green\">Hardware wallets:</span></b> Keys are stored in a thumb-drive device that is kept in a safe place and only connected to a computer when you want to use your crypto. The idea is to try to balance security and convenience.</p><p><b><span style=\"color:green\">Online wallets:</span></b> Keys are stored in an app or other software – look for one that is protected by two-step encryption. This makes sending, receiving, and using your crypto as easy as using any online bank account, payment system, or brokerage.</p><p>Each type has its tradeoffs. Paper and hardware wallets are harder for malicious users to access because they are stored offline, but they are limited in function and risk being lost or destroyed. Online wallets offered by a major exchange like Coinbase are the simplest way to get started in crypto and offer a balance of security and easy access. (Because your private info is online, your protection against hackers is only as good as your wallet provider’s security – so make sure you look for features like two-factor verification.)</p><p><b><span style=\"color:green\">What could be done with the help of Crypto Wallets</span></b><br /></p><ol>  <li>Manage all your digital assets in one secure place</li>  <li>Control your own private keys</li>  <li>Send and receive cryptocurrency to and from anywhere in the world</li>  <li>Interact with usernames rather than long, hexadecimal “public key” addresses</li>  <li>Browse dapps (decentralized finance apps)</li>  <li>Shop at stores that accept cryptocurrency</li></ol><hr /><h4 id=\"references\">REFERENCES:</h4><ol>  <li>    <p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌</p>  </li>  <li>    <p>Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p>  </li>  <li>    <p>“What Is a Crypto Wallet?” @Coinbase, Coinbase, 2021, www.coinbase.com/learn/crypto-basics/what-is-a-crypto-wallet.</p>  </li>  <li>    <p>Wikipedia Contributors. “Cryptocurrency Wallet.” Wikipedia, Wikimedia Foundation, 4 Nov. 2021, en.wikipedia.org/wiki/Cryptocurrency_wallet.</p>  </li>  <li>    <p>Nibley, Brian. “What Is a Crypto Wallet? How It Works &amp; If You Need One.” Business Insider, Business Insider, 28 Oct. 2021, www.businessinsider.com/crypto-wallet.</p>  </li></ol>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/04/what-is-wallet-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-04T00:00:00-03:00",
            "date_modified": "2019-09-04T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/03/what-is-mining-in-blockchain",
            "title": "What is Mining of Block in Blockchain and Cryptocurrency?",
            "summary": null,
            "content_text": "What exactly is Blockchain mining?A peer-to-peer computer process, Blockchain mining is used to secure and verify Cryptocurrency transactions. Mining involves Blockchain miners who add cryptocurrencies transaction data to cryptocurrency’s global public ledger of past transactions. In the ledgers, blocks are secured by Blockchain miners and are connected forming a chain.When we talk in-depth, as opposed to traditional financial services systems, Bitcoins have no central clearinghouse. Bitcoin transactions are generally verified in decentralized clearing systems wherein people contribute computing resources to verify the same. This process of verifying transactions is called mining. It is probably referred to as mining as it is analogous to mining of commodities like gold—mining gold requires a lot of effort and resources, but then there is a limited supply of gold; hence, the amount of gold that is mined every year remains roughly the same. In the same manner, a lot of computing power is consumed in the process of mining bitcoins. The number of bitcoins that are generated from mining dwindles over time. In the words of Satoshi Nakamoto, there’s a limited supply of bitcoins—only 21 million bitcoins will ever be created.At its core, the term ‘Blockchain mining’ is used to describe the process of adding transaction records to the bitcoin blockchain. This process of adding blocks to the blockchain is how transactions are processed and how money moves around securely on Bitcoins. This process of Blockchain mining is performed by a community of people around the world called ‘Blockchain miners.’Anyone can apply to become a Blockchain miner. These Blockchain miners install and run a special Blockchain mining software that enables their computers to communicate securely with one another. Once a computer installs the software, joins the network and begins mining bitcoins, it becomes what is called a ‘node.’ Together, all these nodes communicate with one another and process transactions to add new blocks to the blockchain which is commonly known as the bitcoin network. This bitcoin network runs throughout the day. It processes equivalent to millions of dollars in bitcoin transactions and has never been hacked or experienced downtime since its launch in 2009.Types of MiningThere are mainly three disting types of mining refereed to cryptocurrencies1. Individual Mining When mining is done by an individual, user registration as a miner is necessary. As soon as a transaction takes place, a mathematical problem is given to all the single users in the blockchain network to solve. The first one to solve it gets rewarded.Once the solution is found, all the other miners in the blockchain network will validate the decrypted value and then add it to the blockchain. Thus, verifying the transaction.2. Pool Mining    In pool mining, a group of users works together to approve the transaction. Sometimes, the complexity of the data encrypted in the blocks makes it difficult for a user to decrypt the encoded data alone. So, a group of miners works as a team to solve it. After the validation of the result, the reward is then split between all users.3. Cloud Mining    Cloud mining eliminates the need for computer hardware and software. It’s a hassle-free method to extract blocks. With cloud mining, handling all the machinery, order timings, or selling profits is no longer a constant worry.While it is hassle-free, it has its own set of disadvantages. The operational functionality is limited with the limitations on bitcoin hashing. The operational expenses increase as the reward profits are low. Software upgrades are restricted and so is the verification process.Uses of Blockchain Mining1. Validating Transactions    Cryptocurrencies function without a central administrator and the insecurity can be substantial with the transactions that transpire. So, what is the authentication method with such cryptocurrencies? With each transaction, new blocks are added to the blockchain in the network and the validation lies in the mining results from the blockchain miners.2. Confirming Transactions    Miners work the blockchain mining process to confirm whether the transaction is authentic or not. All confirmed transactions are then included in the blockchain.3. Securing Networks    With more users mining the blockchain,  the blockchain network security increases. Network security ensures that there are no fraudulent activities happening with the cryptocurrencies.REFERENCES:“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.Naveen. “What Is Blockchain Mining?” Intellipaat Blog, Intellipaat, 26 Aug. 2021, intellipaat.com/blog/tutorial/blockchain-tutorial/what-is-bitcoin-mining/.            “Blockchain Explained: How Does a Transaction Get into the Blockchain?      Euromoney Learning.” Euromoney.com, 2016, www.euromoney.com/learning/blockchain-explained/how-transactions-get-into-the-blockchain.      Techopedia. “Mining.” Techopedia.com, Techopedia, 8 May 2017, www.techopedia.com/definition/32530/mining-blockchain.",
            "content_html": "<p><b><span style=\"color:green\">What exactly is Blockchain mining?</span></b><br />A peer-to-peer computer process, <b><span style=\"color:green\">Blockchain mining is used to secure and verify Cryptocurrency transactions.</span></b> Mining involves Blockchain miners who add cryptocurrencies transaction data to cryptocurrency’s global public ledger of past transactions. In the ledgers, blocks are secured by Blockchain miners and are connected forming a chain.</p><p>When we talk in-depth, as opposed to traditional financial services systems, Bitcoins have no central clearinghouse. Bitcoin transactions are generally verified in <b><span style=\"color:green\">decentralized clearing systems wherein people contribute computing resources to verify the same.</span></b> This process of verifying transactions is called mining. It is probably referred to as mining as it is analogous to mining of commodities like gold—mining gold requires a lot of effort and resources, but then there is a limited supply of gold; hence, the amount of gold that is mined every year remains roughly the same. In the same manner, <b><span style=\"color:green\">a lot of computing power is consumed in the process of mining bitcoins.</span></b> The number of bitcoins that are generated from mining dwindles over time. In the words of Satoshi Nakamoto, there’s a limited supply of bitcoins—only 21 million bitcoins will ever be created.</p><p>At its core, the term ‘Blockchain mining’ is used to describe the process of adding transaction records to the bitcoin blockchain. This process of adding blocks to the blockchain is how transactions are processed and how money moves around securely on Bitcoins. This process of Blockchain mining is performed by a community of people around the world called ‘Blockchain miners.’</p><p>Anyone can apply to become a Blockchain miner. These Blockchain miners install and run a <b><span style=\"color:green\">special Blockchain mining software that enables their computers to communicate securely with one another.</span></b> Once a computer installs the software, joins the network and begins mining bitcoins, it becomes what is called a <em><a href=\"https://dhruvdoshi.github.io/blog/2019/09/01/what-is-nodes-in-blockchain\">‘node.’</a></em> Together, all these nodes communicate with one another and process transactions to add new blocks to the blockchain which is commonly known as the bitcoin network. This bitcoin network runs throughout the day. It processes equivalent to millions of dollars in bitcoin transactions and has never been hacked or experienced downtime since its launch in 2009.</p><p><b><span style=\"color:green\">Types of Mining</span></b><br />There are mainly three disting types of mining refereed to cryptocurrencies<br /><br /><b><span style=\"color:green\">1. Individual Mining </span></b><br />When mining is done by an individual, user registration as a miner is necessary. As soon as a transaction takes place, a mathematical problem is given to all the single users in the blockchain network to solve. The first one to solve it gets rewarded.</p><p>Once the solution is found, all the other miners in the blockchain network will validate the decrypted value and then add it to the blockchain. Thus, verifying the transaction.</p><p><b><span style=\"color:green\">2. Pool Mining</span></b><br />    In pool mining, a group of users works together to approve the transaction. Sometimes, the complexity of the data encrypted in the blocks makes it difficult for a user to decrypt the encoded data alone. So, a group of miners works as a team to solve it. After the validation of the result, the reward is then split between all users.</p><p><b><span style=\"color:green\">3. Cloud Mining</span></b><br />    Cloud mining eliminates the need for computer hardware and software. It’s a hassle-free method to extract blocks. With cloud mining, handling all the machinery, order timings, or selling profits is no longer a constant worry.</p><p>While it is hassle-free, it has its own set of disadvantages. The operational functionality is limited with the limitations on bitcoin hashing. The operational expenses increase as the reward profits are low. Software upgrades are restricted and so is the verification process.</p><p><b><span style=\"color:green\">Uses of Blockchain Mining</span></b><br /><br /><b><span style=\"color:green\">1. Validating Transactions</span></b><br />    Cryptocurrencies function without a central administrator and the insecurity can be substantial with the transactions that transpire. So, what is the authentication method with such cryptocurrencies? With each transaction, new blocks are added to the blockchain in the network and the validation lies in the mining results from the blockchain miners.</p><p><b><span style=\"color:green\">2. Confirming Transactions</span></b><br />    Miners work the blockchain mining process to confirm whether the transaction is authentic or not. All confirmed transactions are then included in the blockchain.</p><p><b><span style=\"color:green\">3. Securing Networks</span></b><br />    With more users mining the blockchain,  the blockchain network security increases. Network security ensures that there are no fraudulent activities happening with the cryptocurrencies.</p><hr /><h4 id=\"references\">REFERENCES:</h4><p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</p><p>Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>Naveen. “What Is Blockchain Mining?” Intellipaat Blog, Intellipaat, 26 Aug. 2021, intellipaat.com/blog/tutorial/blockchain-tutorial/what-is-bitcoin-mining/.</p><table>  <tbody>    <tr>      <td>“Blockchain Explained: How Does a Transaction Get into the Blockchain?</td>      <td>Euromoney Learning.” Euromoney.com, 2016, www.euromoney.com/learning/blockchain-explained/how-transactions-get-into-the-blockchain.</td>    </tr>  </tbody></table><p>Techopedia. “Mining.” Techopedia.com, Techopedia, 8 May 2017, www.techopedia.com/definition/32530/mining-blockchain.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/03/what-is-mining-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-03T00:00:00-03:00",
            "date_modified": "2019-09-03T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/02/what-is-timestamping-in-blockchain",
            "title": "Time Stamping in Blockchain and Cryptocurrencies?",
            "summary": "The timestamp or timestamp is a small data stored in each block as a unique serial and whose main function is to determine the exact moment in which the block has been mined and validated by the blockchain network.",
            "content_text": "Trusted timestamping is the process of securely keeping track of the creation and modification time of a document. Security here means that no one—not even the owner of the document—should be able to change it once it has been recorded provided that the timestamp’s integrity is never compromised.Decentralization is one of the fundamental aspects of technology blockchain And of course, that implies that anyone, from any part of the world, can be added to the network and can operate in it. This in turn causes, that there is no universal time code. This is because we can connect from any time zone. The timestamp is a timestamp, which is calculated according to different parameters.The temporal parameter, or timestamp, is based on an instantaneous adjustment that uses a median of the timestamps returned by all nodes of the network. This is due to the decentralized form of it, and seeks to keep the nodes of the network as well synchronized as possible.We must also bear in mind that the timestamps of the blocks are not exact. This is because they do not necessarily have to be in order. However, they still offer a relative precision of between one and two hours, which gives a margin of validity. Basically, all the nodes are connected to the same time slot. For this, the reference is taken UTC-0 (London local time), where UTC It’s in Spanish Coordinated Universal Time. From this, the network nodes coordinate the time in which they work. Now, after storing this data, the local node calculates the displacement time between the UTC strip and the local time.This adjusts between the time of the local node with the displacement of all the nodes that are connected to the network. This allows the network time to be adjusted constantly. This avoids manipulation and usually does with slight time variations concerning the time slot. This is done in this way because there may be many hourly rates and repetitions and other problems could occur. Therefore, a universal timestamp creation system was developed for all nodes. This system takes into account the jet lag that could exist between the nodes.Implementing a timestamp makes the block it is impossible to be repeated in the future, since, in addition to the time, the date of creation of the block is also stored, therefore, there is no possibility that it will be repeated hash that happened a week, two months ago, or a year ago.What is blockchain timestamp used for?&lt;/br&gt;One of the main uses of a timestamp is to establish the parameters of the process of mining is. This is because these timestamps allow nodes to correctly adjust the mining difficulty to be used for each block generation period. Timestamps help the network determine how long it takes to extract blocks for a certain period, and from there adjust the mining difficulty parameter.This of course can open the door for miners to manipulate time to lessen the difficulty. Nevertheless, Satoshi Nakamoto, foresaw this and programmed the network so that nodes ignore blocks that are outside a certain time range based on their own internal clock time. As a result, if a miner tried to do this, he would lose all his mining work.On the other hand, in the whitepaper From Bitcoin, Nakamoto explains that another functionality of the timestamp is to create a mechanism to avoid double-spending. In this regard, Nakamoto wrote the following:      For our purposes, the last transaction is what counts, so we won’t mind other subsequent double-spending attempts.  REFERENCES:“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.Bit2Me Academy. “What Is Timestamp?” Bit2Me Academy, Bit2Me Academy, 12 Dec. 2019, academy.bit2me.com/en/blockchain-timestamp/.CryptoCurrency. “Timestamping with Blockchain — How Does It Work in Practice?” Medium, Medium, Apr. 2020, cryptocurrency.medium.com/timestamping-with-blockchain-how-does-it-work-in-practice-678af43c8b48.“Content Timestamping – Content Blockchain.” Content-Blockchain.org, 2019, content-blockchain.org/scenarios/content-timestamping/.‌",
            "content_html": "<p>Trusted timestamping is the <b><span style=\"color:green\">process of securely keeping track of the creation and modification time of a document.</span></b> Security here means that no one—not even the owner of the document—should be able to change it once it has been recorded provided that the timestamp’s integrity is never compromised.</p><p>Decentralization is one of the fundamental aspects of technology blockchain And of course, that implies that anyone, from any part of the world, can be added to the network and can operate in it. This in turn causes, that there is no universal time code. This is because we can connect from any time zone. The timestamp is a timestamp, which is calculated according to different parameters.</p><p>The temporal parameter, or timestamp, is based on an <b><span style=\"color:green\">instantaneous adjustment that uses a median of the timestamps returned by all nodes of the network.</span></b> This is due to the decentralized form of it, and seeks to keep the nodes of the network as well synchronized as possible.</p><p>We must also bear in mind that the timestamps of the blocks are not exact. This is because they do not necessarily have to be in order. However, they still offer a relative precision of between one and two hours, which gives a margin of validity. Basically, <b><span style=\"color:green\">all the nodes are connected to the same time slot.</span></b> For this, the reference is taken UTC-0 (London local time), where UTC It’s in Spanish Coordinated Universal Time. From this, the network nodes coordinate the time in which they work. Now, after storing this data, the local node calculates the displacement time between the UTC strip and the local time.</p><p>This adjusts between the time of the local node with the displacement of all the nodes that are connected to the network. <b><span style=\"color:green\">This allows the network time to be adjusted constantly</span></b>. This avoids manipulation and usually does with slight time variations concerning the time slot. This is done in this way because there may be many hourly rates and repetitions and other problems could occur. Therefore, a universal timestamp creation system was developed for all nodes. This system takes into account the jet lag that could exist between the nodes.</p><p>Implementing a timestamp makes the block it is <b><span style=\"color:green\">impossible to be repeated in the future</span></b>, since, in addition to the time, the date of creation of the block is also stored, therefore, there is no possibility that it will be repeated hash that happened a week, two months ago, or a year ago.</p><p><br /></p><p><b><span style=\"color:green\">What is blockchain timestamp used for?</span></b>&lt;/br&gt;One of the main uses of a timestamp is to establish the parameters of the process of mining is. This is because these timestamps allow nodes to <b><span style=\"color:green\">correctly adjust the mining difficulty to be used for each block generation period.</span></b> Timestamps help the network determine how long it takes to extract blocks for a certain period, and from there adjust the mining difficulty parameter.</p><p>This of course can open the door for miners to manipulate time to lessen the difficulty. Nevertheless, Satoshi Nakamoto, foresaw this and programmed the network so that nodes ignore blocks that are outside a <b><span style=\"color:green\">certain time range based on their own internal clock time.</span></b> As a result, if a miner tried to do this, he would lose all his mining work.</p><p>On the other hand, in the whitepaper From Bitcoin, Nakamoto explains that another functionality of the timestamp is to create a mechanism to <b><span style=\"color:green\">avoid double-spending.</span></b> In this regard, Nakamoto wrote the following:</p><blockquote>  <blockquote>    <p><b><span style=\"color:green\"><em>For our purposes, the last transaction is what counts, so we won’t mind other subsequent double-spending attempts.</em></span></b></p>  </blockquote></blockquote><hr /><h4 id=\"references\">REFERENCES:</h4><p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</p><p>Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>Bit2Me Academy. “What Is Timestamp?” Bit2Me Academy, Bit2Me Academy, 12 Dec. 2019, academy.bit2me.com/en/blockchain-timestamp/.</p><p>CryptoCurrency. “Timestamping with Blockchain — How Does It Work in Practice?” Medium, Medium, Apr. 2020, cryptocurrency.medium.com/timestamping-with-blockchain-how-does-it-work-in-practice-678af43c8b48.</p><p>“Content Timestamping – Content Blockchain.” Content-Blockchain.org, 2019, content-blockchain.org/scenarios/content-timestamping/.</p><p>‌</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/02/what-is-timestamping-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-02T00:00:00-03:00",
            "date_modified": "2019-09-02T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/09/01/what-is-nodes-in-blockchain",
            "title": "What is Nodes in Blockchain?",
            "summary": "The term “node” is being used mostly about blockchain, a decentralized digital ledger that records all cryptocurrency transactions and makes the information available to everyone via a connected device.",
            "content_text": "A Node is a part of cryptocurrency that is needed to make most of the popular tokens like Bitcoin or Dogecoin function. It’s a fundamental part of the blockchain network, which is the decentralised ledger that is used to maintain a cryptocurrency.The explanation can vary depending on the protocol. For example, a resident network may comprise a file server, three laptops and a fax machine. In this case, the network has five nodes, each equipped with a unique MAC address to identify them.What is a node in blockchain?The term “node” is being used mostly about blockchain, a decentralized digital ledger that records all cryptocurrency transactions and makes the information available to everyone via a connected device. What this means is every transaction has to be chronologically recorded and distributed to a series of connected devices. These devices are called nodes. These nodes communicate with each other within the network and transfer information about transactions and new blocks.It is a critical component of the blockchain infrastructure. It helps maintain the security and integrity of the network. A blockchain node’s main purpose is to verify each batch of network transactions, called blocks. Each node is distinguished from others by a unique identifier.What do nodes do?When a miner attempts to add a new block of transactions to the blockchain, it broadcasts the block to all the nodes on the network. Based on the block’s legitimacy (validity of signature and transactions), nodes can accept or reject the block. When a node accepts a new block of transactions, it saves and stores it on top of the rest of the blocks it already has stored. In short, here is what nodes do:  Nodes check if a block of transactions is valid and accept or reject it.  Nodes save and store blocks of transactions (storing blockchain transaction history).  Nodes broadcast and spread this transaction history to other nodes that may need to synchronize with the blockchain (need to be updated on transaction history).What are the types of nodes?There are basically two types of nodes: full nodes and lightweight nodes.      Full nodes support and provide security to the network. These nodes download a blockchain’s entire history to observe and enforce its rules.        Each user in the network is a lightweight node. The lightweight node has to connect to a full node to be able to participate.  Many volunteers run full Bitcoin nodes in a bid to help the Bitcoin ecosystem. As of now, there are roughly 12,130 public nodes running on the Bitcoin network. Other than the public nodes, there are many hidden nodes (non-listening nodes). These nodes usually run behind a firewall.Miners’ nodesThere is also a third type of node: Miner nodes. The term “Bitcoin miners” has now become familiar. These miners are classified as nodes. the miner may work alone (solo miner) or in groups (pool miner). A solo miner uses his full node. In a mining pool, only the administrator can run a full node — which can be referred to as a pool miner’s full node.The difference between a miner and a nodeA miner always needs to run a full node to select valid transactions to form a new block. Without a full node, it cannot determine what proposed transactions are valid according to the current blockchain’s transaction history (aka if all balances involved in the transactions are sufficient enough to perform the proposed transactions) because it does not have access to the full blockchain history. Therefore, a miner is always also a full node. A node, however, is not necessarily simultaneously a miner. A device can run a full node by receiving, storing and broadcasting all transaction data (much like a server) without actually creating new blocks of transactions itself. In this case, it functions more like a passing point with a directory, whereas a miner is the same but simultaneously tries to create new blocks of transactions as well.Listening nodes (supernodes)And finally, a sub-category called listening nodes. A listening node, essentially, is a publicly visible full node. It communicates with any node that decides to establish a connection with it. A reliable super node typically runs all the time, transmitting blockchain history and transaction data to multiple nodes.REFERENCES:“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.“What Is a Blockchain Node and How Is It Used in Cryptocurrency?” NDTV Gadgets 360, gadgets.ndtv.com/cryptocurrency/features/what-is-a-blockchain-node-how-does-cryptocurrency-work-2515427.Jimi S. “Blockchain: What Are Nodes and Masternodes?” Medium, Coinmonks, 5 Sept. 2018, medium.com/coinmonks/blockchain-what-is-a-node-or-masternode-and-what-does-it-do-4d9a4200938f.",
            "content_html": "<p>A Node is a part of cryptocurrency that is needed to make most of the popular tokens like Bitcoin or Dogecoin function. It’s a fundamental part of the blockchain network, which is the <b><span style=\"color:green\">decentralised ledger that is used to maintain a cryptocurrency.</span></b></p><p>The explanation can vary depending on the protocol. For example, a resident network may comprise a file server, three laptops and a fax machine. In this case, the network has five nodes, each equipped with a unique MAC address to identify them.</p><p><b><span style=\"color:green\">What is a node in blockchain?</span></b><br />The term <em>“node”</em> is being used mostly about blockchain, a decentralized digital ledger that records all cryptocurrency transactions and <b><span style=\"color:green\">makes the information available to everyone via a connected device.</span></b> What this means is every transaction has to be chronologically recorded and distributed to a series of connected devices. These devices are called nodes. These nodes communicate with each other within the network and transfer information about transactions and new blocks.</p><p>It is a critical component of the blockchain infrastructure. It helps maintain the <b><span style=\"color:green\">security and integrity of the network.</span></b> A blockchain node’s main purpose is to verify each batch of network transactions, called blocks. Each node is distinguished from others by a unique identifier.</p><p><b><span style=\"color:green\">What do nodes do?</span></b><br />When a miner attempts to add a new block of transactions to the blockchain, it broadcasts the block to all the nodes on the network. Based on the block’s legitimacy (validity of signature and transactions), <b><span style=\"color:green\">nodes can accept or reject the block.</span></b> When a node accepts a new block of transactions, it saves and stores it on top of the rest of the blocks it already has stored. In short, here is what nodes do:</p><ol>  <li>Nodes check if a block of transactions is valid and accept or reject it.</li>  <li>Nodes save and store blocks of transactions (storing blockchain transaction history).</li>  <li>Nodes broadcast and spread this transaction history to other nodes that may need to synchronize with the blockchain (need to be updated on transaction history).</li></ol><p><b><span style=\"color:green\">What are the types of nodes?</span></b><br />There are basically two types of nodes: <b><span style=\"color:green\">full nodes and lightweight nodes.</span></b></p><ul>  <li>    <p><b><span style=\"color:green\">Full nodes support and provide security</span></b> to the network. These nodes download a blockchain’s entire history to observe and enforce its rules.</p>  </li>  <li>    <p><b><span style=\"color:green\">Each user in the network is a lightweight node.</span></b> The lightweight node has to connect to a full node to be able to participate.</p>  </li></ul><p>Many volunteers run full Bitcoin nodes in a bid to help the Bitcoin ecosystem. As of now, there are roughly <b><span style=\"color:green\">12,130 public nodes</span></b> running on the Bitcoin network. Other than the public nodes, there are many hidden nodes (non-listening nodes). These nodes usually run behind a firewall.</p><p><b><span style=\"color:green\">Miners’ nodes</span></b><br />There is also a third type of node: Miner nodes. The term “Bitcoin miners” has now become familiar. These miners are classified as nodes. the miner may work alone (solo miner) or in groups (pool miner). A solo miner uses his full node. In a mining pool, only the administrator can run a full node — which can be referred to as a pool miner’s full node.</p><p><b><span style=\"color:green\">The difference between a miner and a node</span></b><br />A miner always needs to run a full node to select valid transactions to form a new block. Without a full node, it cannot determine what proposed transactions are valid according to the current blockchain’s transaction history (aka if all balances involved in the transactions are sufficient enough to perform the proposed transactions) because it does not have access to the full blockchain history. Therefore, a miner is always also a full node. A node, however, is not necessarily simultaneously a miner. A device can run a full node by receiving, storing and broadcasting all transaction data (much like a server) without actually creating new blocks of transactions itself. In this case, it functions more like a passing point with a directory, whereas a miner is the same but simultaneously tries to create new blocks of transactions as well.</p><p><b><span style=\"color:green\">Listening nodes (supernodes)</span></b><br />And finally, a sub-category called listening nodes. A listening node, essentially, is a publicly visible full node. It communicates with any node that decides to establish a connection with it. A reliable super node typically runs all the time, transmitting blockchain history and transaction data to multiple nodes.</p><hr /><h4 id=\"references\">REFERENCES:</h4><p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</p><p>Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p><p>“What Is a Blockchain Node and How Is It Used in Cryptocurrency?” NDTV Gadgets 360, gadgets.ndtv.com/cryptocurrency/features/what-is-a-blockchain-node-how-does-cryptocurrency-work-2515427.</p><p>Jimi S. “Blockchain: What Are Nodes and Masternodes?” Medium, Coinmonks, 5 Sept. 2018, medium.com/coinmonks/blockchain-what-is-a-node-or-masternode-and-what-does-it-do-4d9a4200938f.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/09/01/what-is-nodes-in-blockchain",
            
            
            
            
            
            "date_published": "2019-09-01T00:00:00-03:00",
            "date_modified": "2019-09-01T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain",
            "title": "What is Blockchain?",
            "summary": "What is the Blockchain?",
            "content_text": "Blockchain is the technology that allows the user to create a decentralized system of transaction and data transfers. For the naïve person, it is a method to create a people’s bank without central banks! Blockchain technology is used in the backend for each cryptocurrency. Talking about that, Blockchain is building the blocks of every critical data and then chaining the blocks. So if the last block or any previous block is changed or updated, then every information in the chain needs to be updated. This makes blockchain technology secure and more robust compared to other technologies.Blockchain is a shared, immutable ledger that felicitates the process of recording transactions and tracking assets in a business network. An investment can be tangible (a house or a car) or intangible (Intellectual property, patents, or copyrights). Virtually anything of value can be tracked and traded on a blockchain network, reducing risk and cutting costs for all involved.Finally, Blockchain is a growing list of records, called blocks linked together with cryptography which is also described as “trustless and fully decentralized peer to peer immutable data storage which is spread over the network of participants often referred to as the nodes. Every block contains a cryptographic hash of the previous block and the timestamp, and the transaction data.But first, let’s get back to basics. What is Blockchain, and how does it work?A blockchain is a file for storing data. Or, to put it in more technical terms, it’s an open, distributed database system. The data is distributed (i.e., duplicated), and the whole Blockchain is entirely decentralized. This means no one person or entity  (say, a government or corporation like Google or Microsoft) has control over the Blockchain;  this is a radical departure from the centralized (Government databases) databases controlled and administered by businesses and other entities.So how does it work? In straightforward terms, the file consists of blocks of data, with each block being connected to the previous block with the hashing code,  forming a chain. Hence, the name “blockchain.” As well as the data itself, each block also contains a record of when that block was created or edited. It contains the hash code of the previous block, which makes it very useful for maintaining a complex system of records that cannot be corrupted or lost, and this is the primary use case to preserve the integrity of the data.Because the whole Blockchain is duplicated across many computers,  any user can view the entire Blockchain in the case of public blockchains. Transactions or records are processed not by one central administrator but by a network of users who work to verify the data and achieve a consensus; these verifiers are known as miners, each miner is paid some cryptocurrency for successful mining. If this sounds familiar, it’s because Bitcoin operates in the same way. Bitcoin is the first example of Blockchain in action.REFERENCES:“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.",
            "content_html": "<p>Blockchain is the technology that allows the user to <b><span style=\"color:green\">create a decentralized system of transaction and data transfers</span></b>. For the naïve person, it is a method to create a people’s bank without central banks! Blockchain technology is used in the backend for each cryptocurrency. Talking about that, Blockchain is building the blocks of every critical data and then chaining the blocks. So if the last block or any previous block is changed or updated, then every information in the chain needs to be updated. This makes blockchain technology secure and more robust compared to other technologies.</p><p>Blockchain is a <b><span style=\"color:green\">shared, immutable ledger that felicitates the process of recording transactions and tracking assets in a business network</span></b>. An investment can be tangible (a house or a car) or intangible (Intellectual property, patents, or copyrights). Virtually anything of value can be tracked and traded on a blockchain network, reducing risk and cutting costs for all involved.</p><p>Finally, Blockchain is a growing list of records, called blocks linked together with cryptography which is also described as “trustless and fully decentralized peer to peer immutable data storage which is spread over the network of participants often referred to as the nodes. Every block contains a <b><span style=\"color:green\">cryptographic hash of the previous block and the timestamp</span></b>, and the transaction data.</p><p>But first, let’s get back to basics. What is Blockchain, and how does it work?</p><p>A blockchain is a file for storing data. Or, to put it in more technical terms, it’s an open, distributed database system. The data is distributed (i.e., duplicated), and the whole Blockchain is entirely decentralized. This means no one person or entity  (say, a government or corporation like Google or Microsoft) has control over the Blockchain;  this is a radical departure from the centralized (Government databases) databases controlled and administered by businesses and other entities.</p><p>So how does it work? In straightforward terms, the file consists of blocks of data, with each block being connected to the previous block with the hashing code,  forming a chain. Hence, the name <b><span style=\"color:green\">“blockchain.”</span></b> As well as the data itself, each block also contains a record of when that block was created or edited. It contains the hash code of the previous block, which makes it very useful for maintaining a complex system of records that cannot be corrupted or lost, and this is the primary use case to preserve the integrity of the data.</p><p>Because the whole Blockchain is duplicated across many computers,  any user can view the entire Blockchain in the case of public blockchains. Transactions or records are processed not by one central administrator but by a network of users who work to verify the data and achieve a consensus; these verifiers are known as miners, each miner is paid some cryptocurrency for successful mining. If this sounds familiar, it’s because Bitcoin operates in the same way. <b><span style=\"color:green\">Bitcoin</span></b> is the first example of Blockchain in action.</p><hr /><h4 id=\"references\">REFERENCES:</h4><p>“What Is Blockchain Technology? - IBM Blockchain IBM.” Ibm.com, 2021, www.ibm.com/topics/what-is-blockchain.</p><p>‌Wikipedia Contributors. “Blockchain.” Wikipedia, Wikimedia Foundation, 16 Oct. 2021, en.wikipedia.org/wiki/Blockchain.</p>",
            "url": "https://dhruvdoshi.github.io/blog/2019/08/31/what-is-blockchain",
            
            
            
            
            
            "date_published": "2019-08-31T00:00:00-03:00",
            "date_modified": "2019-08-31T00:00:00-03:00",
            
                "author":  {
                "name": "Dhruv Doshi",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}